Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_reg.h
/**
 * \file IfxCan_reg.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 *
 * Date: 2015-12-17 16:15:10 GMT
 * Version: TBD
 * Specification: TBD
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Can_Registers_Cfg Can address
 * \ingroup IfxLld_Can_Registers
 * 
 * \defgroup IfxLld_Can_Registers_Cfg_BaseAddress Base address
 * \ingroup IfxLld_Can_Registers_Cfg
 *
 * \defgroup IfxLld_Can_Registers_Cfg_Can0 2-CAN0
 * \ingroup IfxLld_Can_Registers_Cfg
 *
 * \defgroup IfxLld_Can_Registers_Cfg_Can1 2-CAN1
 * \ingroup IfxLld_Can_Registers_Cfg
 *
 * \defgroup IfxLld_Can_Registers_Cfg_Can2 2-CAN2
 * \ingroup IfxLld_Can_Registers_Cfg
 *
 *
 */
#ifndef IFXCAN_REG_H
#define IFXCAN_REG_H 1
/******************************************************************************/
#include "IfxCan_regdef.h"
/******************************************************************************/
/** \addtogroup IfxLld_Can_Cfg_BaseAddress
 * \{  */

/** \brief CAN object */
#define MODULE_CAN0 /*lint --e(923)*/ ((*(Ifx_CAN*)0xF0200000u))
#define MODULE_CAN1 /*lint --e(923)*/ ((*(Ifx_CAN*)0xF0210000u))
#define MODULE_CAN2 /*lint --e(923)*/ ((*(Ifx_CAN*)0xF0220000u))
/** \}  */

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Can_Cfg_Can0
 * \{  */
/** \brief 0, CAN Clock Control Register */
#define CAN0_CLC /*lint --e(923)*/ (*(volatile Ifx_CAN_CLC*)0xF0208000u)

/** \brief 8, Module Identification Register */
#define CAN0_ID /*lint --e(923)*/ (*(volatile Ifx_CAN_ID*)0xF0208008u)

/** \brief 20, Interrupt routing for Groups 1 */
#define CAN0_GRINT1 /*lint --e(923)*/ (*(volatile Ifx_CAN_GRINT1*)0xF0208020u)

/** \brief 24, Interrupt routing for Groups 2 */
#define CAN0_GRINT2 /*lint --e(923)*/ (*(volatile Ifx_CAN_GRINT2*)0xF0208024u)

/** \brief 30, Module Control Register */
#define CAN0_MCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MCR*)0xF0208030u)

/** \brief 34, Buffer receive address and transmit address */
#define CAN0_BUFADR /*lint --e(923)*/ (*(volatile Ifx_CAN_BUFADR*)0xF0208034u)

/** \brief 40, Measure Control Register */
#define CAN0_MECR /*lint --e(923)*/ (*(volatile Ifx_CAN_MECR*)0xF0208040u)

/** \brief 44, Measure Status Register */
#define CAN0_MESTAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MESTAT*)0xF0208044u)

/** \brief D8, Access Enable Register CTR 1 */
#define CAN0_ACCENCTR1 /*lint --e(923)*/ (*(volatile Ifx_CAN_ACCENCTR1*)0xF02080D8u)

/** \brief DC, Access Enable Register Control 0 */
#define CAN0_ACCENCTR0 /*lint --e(923)*/ (*(volatile Ifx_CAN_ACCENCTR0*)0xF02080DCu)

/** \brief E8, OCDS Control and Status */
#define CAN0_OCS /*lint --e(923)*/ (*(volatile Ifx_CAN_OCS*)0xF02080E8u)

/** \brief EC, Kernel Reset Status Clear Register */
#define CAN0_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_CAN_KRSTCLR*)0xF02080ECu)

/** \brief F0, Kernel Reset Register 1 */
#define CAN0_KRST1 /*lint --e(923)*/ (*(volatile Ifx_CAN_KRST1*)0xF02080F0u)

/** \brief F4, Kernel Reset Register 0 */
#define CAN0_KRST0 /*lint --e(923)*/ (*(volatile Ifx_CAN_KRST0*)0xF02080F4u)

/** \brief F8, Access Enable Register 1 */
#define CAN0_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_CAN_ACCEN1*)0xF02080F8u)

/** \brief FC, Access Enable Register 0 */
#define CAN0_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_CAN_ACCEN0*)0xF02080FCu)

/** \brief 100, Access Enable Register CAN Node ${i} 0 */
#define CAN0_N0_ACCENNODE0_ /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ACCENNODE0_*)0xF0208100u)
/** Alias (User Manual Name) for CAN0_N0_ACCENNODE0_.
* To use register names with standard convension, please use CAN0_N0_ACCENNODE0_.
*/
#define CAN0_ACCENNODE00 (CAN0_N0_ACCENNODE0_)

/** \brief 104, Access Enable Register CAN Node ${i} 1 */
#define CAN0_N0_ACCENNODE1_ /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ACCENNODE1_*)0xF0208104u)
/** Alias (User Manual Name) for CAN0_N0_ACCENNODE1_.
* To use register names with standard convension, please use CAN0_N0_ACCENNODE1_.
*/
#define CAN0_ACCENNODE01 (CAN0_N0_ACCENNODE1_)

/** \brief 108, Start Address Node ${i} */
#define CAN0_N0_STARTADR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_STARTADR*)0xF0208108u)
/** Alias (User Manual Name) for CAN0_N0_STARTADR.
* To use register names with standard convension, please use CAN0_N0_STARTADR.
*/
#define CAN0_STARTADR0 (CAN0_N0_STARTADR)

/** \brief 10C, End Address Node ${i} */
#define CAN0_N0_ENDADR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ENDADR*)0xF020810Cu)
/** Alias (User Manual Name) for CAN0_N0_ENDADR.
* To use register names with standard convension, please use CAN0_N0_ENDADR.
*/
#define CAN0_ENDADR0 (CAN0_N0_ENDADR)

/** \brief 110, Interrupt Signalling Register ${i} */
#define CAN0_N0_ISREG /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ISREG*)0xF0208110u)
/** Alias (User Manual Name) for CAN0_N0_ISREG.
* To use register names with standard convension, please use CAN0_N0_ISREG.
*/
#define CAN0_ISREG0 (CAN0_N0_ISREG)

/** \brief 120, Node ${i} Timer Clock Control Register */
#define CAN0_N0_NT_CCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_CCR*)0xF0208120u)
/** Alias (User Manual Name) for CAN0_N0_NT_CCR.
* To use register names with standard convension, please use CAN0_N0_NT_CCR.
*/
#define CAN0_NTCCR0 (CAN0_N0_NT_CCR)

/** \brief 124, Node ${i} Timer A Transmit Trigger Register */
#define CAN0_N0_NT_ATTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_ATTR*)0xF0208124u)
/** Alias (User Manual Name) for CAN0_N0_NT_ATTR.
* To use register names with standard convension, please use CAN0_N0_NT_ATTR.
*/
#define CAN0_NTATTR0 (CAN0_N0_NT_ATTR)

/** \brief 128, Node ${i} Timer B Transmit Trigger Register */
#define CAN0_N0_NT_BTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_BTTR*)0xF0208128u)
/** Alias (User Manual Name) for CAN0_N0_NT_BTTR.
* To use register names with standard convension, please use CAN0_N0_NT_BTTR.
*/
#define CAN0_NTBTTR0 (CAN0_N0_NT_BTTR)

