Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_reg.h
/** \brief 12C, Node ${i} Timer C Transmit Trigger Register */
#define CAN0_N0_NT_CTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_CTTR*)0xF020812Cu)
/** Alias (User Manual Name) for CAN0_N0_NT_CTTR.
* To use register names with standard convension, please use CAN0_N0_NT_CTTR.
*/
#define CAN0_NTCTTR0 (CAN0_N0_NT_CTTR)

/** \brief 130, Node ${i} Timer Receive Timeout Register */
#define CAN0_N0_NT_RTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_RTR*)0xF0208130u)
/** Alias (User Manual Name) for CAN0_N0_NT_RTR.
* To use register names with standard convension, please use CAN0_N0_NT_RTR.
*/
#define CAN0_NTRTR0 (CAN0_N0_NT_RTR)

/** \brief 140, Node ${i} Port Control Register */
#define CAN0_N0_NPCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NPCR*)0xF0208140u)
/** Alias (User Manual Name) for CAN0_N0_NPCR.
* To use register names with standard convension, please use CAN0_N0_NPCR.
*/
#define CAN0_NPCR0 (CAN0_N0_NPCR)

/** \brief 1F0, Time Trigger Control Register */
#define CAN0_N0_TTCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTCR*)0xF02081F0u)
/** Alias (User Manual Name) for CAN0_N0_TTCR.
* To use register names with standard convension, please use CAN0_N0_TTCR.
*/
#define CAN0_TTCR0 (CAN0_N0_TTCR)

/** \brief 200, Core Release Register ${i} */
#define CAN0_N0_CREL /*lint --e(923)*/ (*(volatile Ifx_CAN_N_CREL*)0xF0208200u)
/** Alias (User Manual Name) for CAN0_N0_CREL.
* To use register names with standard convension, please use CAN0_N0_CREL.
*/
#define CAN0_CREL0 (CAN0_N0_CREL)

/** \brief 204, Endian Register ${i} */
#define CAN0_N0_ENDN /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ENDN*)0xF0208204u)
/** Alias (User Manual Name) for CAN0_N0_ENDN.
* To use register names with standard convension, please use CAN0_N0_ENDN.
*/
#define CAN0_ENDN0 (CAN0_N0_ENDN)

/** \brief 20C, Data Bit Timing & Prescaler Register ${i} */
#define CAN0_N0_DBTP /*lint --e(923)*/ (*(volatile Ifx_CAN_N_DBTP*)0xF020820Cu)
/** Alias (User Manual Name) for CAN0_N0_DBTP.
* To use register names with standard convension, please use CAN0_N0_DBTP.
*/
#define CAN0_DBTP0 (CAN0_N0_DBTP)

/** \brief 210, Test Register ${i} */
#define CAN0_N0_TEST /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TEST*)0xF0208210u)
/** Alias (User Manual Name) for CAN0_N0_TEST.
* To use register names with standard convension, please use CAN0_N0_TEST.
*/
#define CAN0_TEST0 (CAN0_N0_TEST)

/** \brief 214, RAM Watchdog ${i} */
#define CAN0_N0_RWD /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RWD*)0xF0208214u)
/** Alias (User Manual Name) for CAN0_N0_RWD.
* To use register names with standard convension, please use CAN0_N0_RWD.
*/
#define CAN0_RWD0 (CAN0_N0_RWD)

/** \brief 218, CC Control Register ${i} */
#define CAN0_N0_CCCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_CCCR*)0xF0208218u)
/** Alias (User Manual Name) for CAN0_N0_CCCR.
* To use register names with standard convension, please use CAN0_N0_CCCR.
*/
#define CAN0_CCCR0 (CAN0_N0_CCCR)

/** \brief 21C, Nominal Bit Timing & Prescaler Register ${i} */
#define CAN0_N0_NBTP /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NBTP*)0xF020821Cu)
/** Alias (User Manual Name) for CAN0_N0_NBTP.
* To use register names with standard convension, please use CAN0_N0_NBTP.
*/
#define CAN0_NBTP0 (CAN0_N0_NBTP)

/** \brief 220, Timestamp Counter Configuration ${i} */
#define CAN0_N0_TSCC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TSCC*)0xF0208220u)
/** Alias (User Manual Name) for CAN0_N0_TSCC.
* To use register names with standard convension, please use CAN0_N0_TSCC.
*/
#define CAN0_TSCC0 (CAN0_N0_TSCC)

/** \brief 224, Timestamp Counter Value ${i} */
#define CAN0_N0_TSCV /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TSCV*)0xF0208224u)
/** Alias (User Manual Name) for CAN0_N0_TSCV.
* To use register names with standard convension, please use CAN0_N0_TSCV.
*/
#define CAN0_TSCV0 (CAN0_N0_TSCV)

/** \brief 228, Timeout Counter Configuration ${i} */
#define CAN0_N0_TOCC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TOCC*)0xF0208228u)
/** Alias (User Manual Name) for CAN0_N0_TOCC.
* To use register names with standard convension, please use CAN0_N0_TOCC.
*/
#define CAN0_TOCC0 (CAN0_N0_TOCC)

/** \brief 22C, Timeout Counter Value ${i} */
#define CAN0_N0_TOCV /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TOCV*)0xF020822Cu)
/** Alias (User Manual Name) for CAN0_N0_TOCV.
* To use register names with standard convension, please use CAN0_N0_TOCV.
*/
#define CAN0_TOCV0 (CAN0_N0_TOCV)

/** \brief 240, Error Counter Register ${i} */
#define CAN0_N0_ECR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ECR*)0xF0208240u)
/** Alias (User Manual Name) for CAN0_N0_ECR.
* To use register names with standard convension, please use CAN0_N0_ECR.
*/
#define CAN0_ECR0 (CAN0_N0_ECR)

/** \brief 244, Protocol Status Register ${i} */
#define CAN0_N0_PSR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_PSR*)0xF0208244u)
/** Alias (User Manual Name) for CAN0_N0_PSR.
* To use register names with standard convension, please use CAN0_N0_PSR.
*/
#define CAN0_PSR0 (CAN0_N0_PSR)

/** \brief 248, Transmitter Delay Compensation Register ${i} */
#define CAN0_N0_TDCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TDCR*)0xF0208248u)
/** Alias (User Manual Name) for CAN0_N0_TDCR.
* To use register names with standard convension, please use CAN0_N0_TDCR.
*/
#define CAN0_TDCR0 (CAN0_N0_TDCR)

/** \brief 250, Interrupt Register ${i} */
#define CAN0_N0_IR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IR*)0xF0208250u)
/** Alias (User Manual Name) for CAN0_N0_IR.
* To use register names with standard convension, please use CAN0_N0_IR.
*/
#define CAN0_IR0 (CAN0_N0_IR)

/** \brief 254, Interrupt Enable ${i} */
#define CAN0_N0_IE /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IE*)0xF0208254u)
/** Alias (User Manual Name) for CAN0_N0_IE.
* To use register names with standard convension, please use CAN0_N0_IE.
*/
#define CAN0_IE0 (CAN0_N0_IE)

/** \brief 280, Global Filter Configuration ${i} */
#define CAN0_N0_GFC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_GFC*)0xF0208280u)
/** Alias (User Manual Name) for CAN0_N0_GFC.
* To use register names with standard convension, please use CAN0_N0_GFC.
*/
#define CAN0_GFC0 (CAN0_N0_GFC)

