Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_reg.h
/** \brief 2F4, Tx Event FIFO Status ${i} */
#define CAN0_N0_TX_EFS /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_EFS*)0xF02082F4u)
/** Alias (User Manual Name) for CAN0_N0_TX_EFS.
* To use register names with standard convension, please use CAN0_N0_TX_EFS.
*/
#define CAN0_TXEFS0 (CAN0_N0_TX_EFS)

/** \brief 2F8, Tx Event FIFO Acknowledge ${i} */
#define CAN0_N0_TX_EFA /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_EFA*)0xF02082F8u)
/** Alias (User Manual Name) for CAN0_N0_TX_EFA.
* To use register names with standard convension, please use CAN0_N0_TX_EFA.
*/
#define CAN0_TXEFA0 (CAN0_N0_TX_EFA)

/** \brief 300, TT Trigger Memory Configuration ${i} */
#define CAN0_N0_TT_TMC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TT_TMC*)0xF0208300u)
/** Alias (User Manual Name) for CAN0_N0_TT_TMC.
* To use register names with standard convension, please use CAN0_N0_TT_TMC.
*/
#define CAN0_TTTMC0 (CAN0_N0_TT_TMC)

/** \brief 304, TT Reference Message Configuration ${i} */
#define CAN0_N0_TT_RMC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TT_RMC*)0xF0208304u)
/** Alias (User Manual Name) for CAN0_N0_TT_RMC.
* To use register names with standard convension, please use CAN0_N0_TT_RMC.
*/
#define CAN0_TTRMC0 (CAN0_N0_TT_RMC)

/** \brief 308, TT Operation Configuration ${i} */
#define CAN0_N0_TT_OCF /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TT_OCF*)0xF0208308u)
/** Alias (User Manual Name) for CAN0_N0_TT_OCF.
* To use register names with standard convension, please use CAN0_N0_TT_OCF.
*/
#define CAN0_TTOCF0 (CAN0_N0_TT_OCF)

/** \brief 30C, TT Matrix Limits ${i} */
#define CAN0_N0_TT_MLM /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TT_MLM*)0xF020830Cu)
/** Alias (User Manual Name) for CAN0_N0_TT_MLM.
* To use register names with standard convension, please use CAN0_N0_TT_MLM.
*/
#define CAN0_TTMLM0 (CAN0_N0_TT_MLM)

/** \brief 310, TUR Configuration ${i} */
#define CAN0_N0_TT_TURCF /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TT_TURCF*)0xF0208310u)
/** Alias (User Manual Name) for CAN0_N0_TT_TURCF.
* To use register names with standard convension, please use CAN0_N0_TT_TURCF.
*/
#define CAN0_TURCF0 (CAN0_N0_TT_TURCF)

/** \brief 314, TT Operation Control ${i} */
#define CAN0_N0_TT_OCN /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TT_OCN*)0xF0208314u)
/** Alias (User Manual Name) for CAN0_N0_TT_OCN.
* To use register names with standard convension, please use CAN0_N0_TT_OCN.
*/
#define CAN0_TTOCN0 (CAN0_N0_TT_OCN)

/** \brief 318, TT Global Time Preset ${i} */
#define CAN0_N0_TT_GTP /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TT_GTP*)0xF0208318u)
/** Alias (User Manual Name) for CAN0_N0_TT_GTP.
* To use register names with standard convension, please use CAN0_N0_TT_GTP.
*/
#define CAN0_TTGTP0 (CAN0_N0_TT_GTP)

/** \brief 31C, TT Time Mark ${i} */
#define CAN0_N0_TT_TMK /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TT_TMK*)0xF020831Cu)
/** Alias (User Manual Name) for CAN0_N0_TT_TMK.
* To use register names with standard convension, please use CAN0_N0_TT_TMK.
*/
#define CAN0_TTTMK0 (CAN0_N0_TT_TMK)

/** \brief 320, TT Interrupt Register ${i} */
#define CAN0_N0_TT_IR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TT_IR*)0xF0208320u)
/** Alias (User Manual Name) for CAN0_N0_TT_IR.
* To use register names with standard convension, please use CAN0_N0_TT_IR.
*/
#define CAN0_TTIR0 (CAN0_N0_TT_IR)

/** \brief 324, TT Interrupt Enable ${i} */
#define CAN0_N0_TT_IE /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TT_IE*)0xF0208324u)
/** Alias (User Manual Name) for CAN0_N0_TT_IE.
* To use register names with standard convension, please use CAN0_N0_TT_IE.
*/
#define CAN0_TTIE0 (CAN0_N0_TT_IE)

/** \brief 328, TT Interrupt Line Select ${i} */
#define CAN0_N0_TT_ILS /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TT_ILS*)0xF0208328u)
/** Alias (User Manual Name) for CAN0_N0_TT_ILS.
* To use register names with standard convension, please use CAN0_N0_TT_ILS.
*/
#define CAN0_TTILS0 (CAN0_N0_TT_ILS)

/** \brief 32C, TT Operation Status ${i} */
#define CAN0_N0_TT_OST /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TT_OST*)0xF020832Cu)
/** Alias (User Manual Name) for CAN0_N0_TT_OST.
* To use register names with standard convension, please use CAN0_N0_TT_OST.
*/
#define CAN0_TTOST0 (CAN0_N0_TT_OST)

/** \brief 330, TUR Numerator Actual ${i} */
#define CAN0_N0_TT_TURNA /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TT_TURNA*)0xF0208330u)
/** Alias (User Manual Name) for CAN0_N0_TT_TURNA.
* To use register names with standard convension, please use CAN0_N0_TT_TURNA.
*/
#define CAN0_TURNA0 (CAN0_N0_TT_TURNA)

/** \brief 334, TT Local & Global Time ${i} */
#define CAN0_N0_TT_LGT /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TT_LGT*)0xF0208334u)
/** Alias (User Manual Name) for CAN0_N0_TT_LGT.
* To use register names with standard convension, please use CAN0_N0_TT_LGT.
*/
#define CAN0_TTLGT0 (CAN0_N0_TT_LGT)

/** \brief 338, TT Cycle Time & Count ${i} */
#define CAN0_N0_TT_CTC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TT_CTC*)0xF0208338u)
/** Alias (User Manual Name) for CAN0_N0_TT_CTC.
* To use register names with standard convension, please use CAN0_N0_TT_CTC.
*/
#define CAN0_TTCTC0 (CAN0_N0_TT_CTC)

/** \brief 33C, TT Capture Time ${i} */
#define CAN0_N0_TT_CPT /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TT_CPT*)0xF020833Cu)
/** Alias (User Manual Name) for CAN0_N0_TT_CPT.
* To use register names with standard convension, please use CAN0_N0_TT_CPT.
*/
#define CAN0_TTCPT0 (CAN0_N0_TT_CPT)

/** \brief 340, TT Cycle Sync Mark ${i} */
#define CAN0_N0_TT_CSM /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TT_CSM*)0xF0208340u)
/** Alias (User Manual Name) for CAN0_N0_TT_CSM.
* To use register names with standard convension, please use CAN0_N0_TT_CSM.
*/
#define CAN0_TTCSM0 (CAN0_N0_TT_CSM)

/** \brief 500, Access Enable Register CAN Node ${i} 0 */
#define CAN0_N1_ACCENNODE0_ /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ACCENNODE0_*)0xF0208500u)
/** Alias (User Manual Name) for CAN0_N1_ACCENNODE0_.
* To use register names with standard convension, please use CAN0_N1_ACCENNODE0_.
*/
#define CAN0_ACCENNODE10 (CAN0_N1_ACCENNODE0_)

/** \brief 504, Access Enable Register CAN Node ${i} 1 */
#define CAN0_N1_ACCENNODE1_ /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ACCENNODE1_*)0xF0208504u)
/** Alias (User Manual Name) for CAN0_N1_ACCENNODE1_.
* To use register names with standard convension, please use CAN0_N1_ACCENNODE1_.
*/
#define CAN0_ACCENNODE11 (CAN0_N1_ACCENNODE1_)

/** \brief 508, Start Address Node ${i} */
#define CAN0_N1_STARTADR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_STARTADR*)0xF0208508u)
/** Alias (User Manual Name) for CAN0_N1_STARTADR.
* To use register names with standard convension, please use CAN0_N1_STARTADR.
*/
#define CAN0_STARTADR1 (CAN0_N1_STARTADR)

/** \brief 50C, End Address Node ${i} */
#define CAN0_N1_ENDADR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ENDADR*)0xF020850Cu)
/** Alias (User Manual Name) for CAN0_N1_ENDADR.
* To use register names with standard convension, please use CAN0_N1_ENDADR.
*/
#define CAN0_ENDADR1 (CAN0_N1_ENDADR)

/** \brief 510, Interrupt Signalling Register ${i} */
#define CAN0_N1_ISREG /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ISREG*)0xF0208510u)
/** Alias (User Manual Name) for CAN0_N1_ISREG.
* To use register names with standard convension, please use CAN0_N1_ISREG.
*/
#define CAN0_ISREG1 (CAN0_N1_ISREG)

/** \brief 520, Node ${i} Timer Clock Control Register */
#define CAN0_N1_NT_CCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_CCR*)0xF0208520u)
/** Alias (User Manual Name) for CAN0_N1_NT_CCR.
* To use register names with standard convension, please use CAN0_N1_NT_CCR.
*/
#define CAN0_NTCCR1 (CAN0_N1_NT_CCR)

