Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_reg.h
/** \brief 6E0, Tx Buffer Transmission Interrupt Enable ${i} */
#define CAN0_N1_TX_BTIE /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BTIE*)0xF02086E0u)
/** Alias (User Manual Name) for CAN0_N1_TX_BTIE.
* To use register names with standard convension, please use CAN0_N1_TX_BTIE.
*/
#define CAN0_TXBTIE1 (CAN0_N1_TX_BTIE)

/** \brief 6E4, Tx Buffer Cancellation Finished Interrupt Enable ${i} */
#define CAN0_N1_TX_BCIE /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BCIE*)0xF02086E4u)
/** Alias (User Manual Name) for CAN0_N1_TX_BCIE.
* To use register names with standard convension, please use CAN0_N1_TX_BCIE.
*/
#define CAN0_TXBCIE1 (CAN0_N1_TX_BCIE)

/** \brief 6F0, Tx Event FIFO Configuration ${i} */
#define CAN0_N1_TX_EFC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_EFC*)0xF02086F0u)
/** Alias (User Manual Name) for CAN0_N1_TX_EFC.
* To use register names with standard convension, please use CAN0_N1_TX_EFC.
*/
#define CAN0_TXEFC1 (CAN0_N1_TX_EFC)

/** \brief 6F4, Tx Event FIFO Status ${i} */
#define CAN0_N1_TX_EFS /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_EFS*)0xF02086F4u)
/** Alias (User Manual Name) for CAN0_N1_TX_EFS.
* To use register names with standard convension, please use CAN0_N1_TX_EFS.
*/
#define CAN0_TXEFS1 (CAN0_N1_TX_EFS)

/** \brief 6F8, Tx Event FIFO Acknowledge ${i} */
#define CAN0_N1_TX_EFA /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_EFA*)0xF02086F8u)
/** Alias (User Manual Name) for CAN0_N1_TX_EFA.
* To use register names with standard convension, please use CAN0_N1_TX_EFA.
*/
#define CAN0_TXEFA1 (CAN0_N1_TX_EFA)

/** \brief 900, Access Enable Register CAN Node ${i} 0 */
#define CAN0_N2_ACCENNODE0_ /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ACCENNODE0_*)0xF0208900u)
/** Alias (User Manual Name) for CAN0_N2_ACCENNODE0_.
* To use register names with standard convension, please use CAN0_N2_ACCENNODE0_.
*/
#define CAN0_ACCENNODE20 (CAN0_N2_ACCENNODE0_)

/** \brief 904, Access Enable Register CAN Node ${i} 1 */
#define CAN0_N2_ACCENNODE1_ /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ACCENNODE1_*)0xF0208904u)
/** Alias (User Manual Name) for CAN0_N2_ACCENNODE1_.
* To use register names with standard convension, please use CAN0_N2_ACCENNODE1_.
*/
#define CAN0_ACCENNODE21 (CAN0_N2_ACCENNODE1_)

/** \brief 908, Start Address Node ${i} */
#define CAN0_N2_STARTADR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_STARTADR*)0xF0208908u)
/** Alias (User Manual Name) for CAN0_N2_STARTADR.
* To use register names with standard convension, please use CAN0_N2_STARTADR.
*/
#define CAN0_STARTADR2 (CAN0_N2_STARTADR)

/** \brief 90C, End Address Node ${i} */
#define CAN0_N2_ENDADR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ENDADR*)0xF020890Cu)
/** Alias (User Manual Name) for CAN0_N2_ENDADR.
* To use register names with standard convension, please use CAN0_N2_ENDADR.
*/
#define CAN0_ENDADR2 (CAN0_N2_ENDADR)

/** \brief 910, Interrupt Signalling Register ${i} */
#define CAN0_N2_ISREG /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ISREG*)0xF0208910u)
/** Alias (User Manual Name) for CAN0_N2_ISREG.
* To use register names with standard convension, please use CAN0_N2_ISREG.
*/
#define CAN0_ISREG2 (CAN0_N2_ISREG)

/** \brief 920, Node ${i} Timer Clock Control Register */
#define CAN0_N2_NT_CCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_CCR*)0xF0208920u)
/** Alias (User Manual Name) for CAN0_N2_NT_CCR.
* To use register names with standard convension, please use CAN0_N2_NT_CCR.
*/
#define CAN0_NTCCR2 (CAN0_N2_NT_CCR)

/** \brief 924, Node ${i} Timer A Transmit Trigger Register */
#define CAN0_N2_NT_ATTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_ATTR*)0xF0208924u)
/** Alias (User Manual Name) for CAN0_N2_NT_ATTR.
* To use register names with standard convension, please use CAN0_N2_NT_ATTR.
*/
#define CAN0_NTATTR2 (CAN0_N2_NT_ATTR)

/** \brief 928, Node ${i} Timer B Transmit Trigger Register */
#define CAN0_N2_NT_BTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_BTTR*)0xF0208928u)
/** Alias (User Manual Name) for CAN0_N2_NT_BTTR.
* To use register names with standard convension, please use CAN0_N2_NT_BTTR.
*/
#define CAN0_NTBTTR2 (CAN0_N2_NT_BTTR)

/** \brief 92C, Node ${i} Timer C Transmit Trigger Register */
#define CAN0_N2_NT_CTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_CTTR*)0xF020892Cu)
/** Alias (User Manual Name) for CAN0_N2_NT_CTTR.
* To use register names with standard convension, please use CAN0_N2_NT_CTTR.
*/
#define CAN0_NTCTTR2 (CAN0_N2_NT_CTTR)

/** \brief 930, Node ${i} Timer Receive Timeout Register */
#define CAN0_N2_NT_RTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_RTR*)0xF0208930u)
/** Alias (User Manual Name) for CAN0_N2_NT_RTR.
* To use register names with standard convension, please use CAN0_N2_NT_RTR.
*/
#define CAN0_NTRTR2 (CAN0_N2_NT_RTR)

/** \brief 940, Node ${i} Port Control Register */
#define CAN0_N2_NPCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NPCR*)0xF0208940u)
/** Alias (User Manual Name) for CAN0_N2_NPCR.
* To use register names with standard convension, please use CAN0_N2_NPCR.
*/
#define CAN0_NPCR2 (CAN0_N2_NPCR)

/** \brief A00, Core Release Register ${i} */
#define CAN0_N2_CREL /*lint --e(923)*/ (*(volatile Ifx_CAN_N_CREL*)0xF0208A00u)
/** Alias (User Manual Name) for CAN0_N2_CREL.
* To use register names with standard convension, please use CAN0_N2_CREL.
*/
#define CAN0_CREL2 (CAN0_N2_CREL)

/** \brief A04, Endian Register ${i} */
#define CAN0_N2_ENDN /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ENDN*)0xF0208A04u)
/** Alias (User Manual Name) for CAN0_N2_ENDN.
* To use register names with standard convension, please use CAN0_N2_ENDN.
*/
#define CAN0_ENDN2 (CAN0_N2_ENDN)

/** \brief A0C, Data Bit Timing & Prescaler Register ${i} */
#define CAN0_N2_DBTP /*lint --e(923)*/ (*(volatile Ifx_CAN_N_DBTP*)0xF0208A0Cu)
/** Alias (User Manual Name) for CAN0_N2_DBTP.
* To use register names with standard convension, please use CAN0_N2_DBTP.
*/
#define CAN0_DBTP2 (CAN0_N2_DBTP)

/** \brief A10, Test Register ${i} */
#define CAN0_N2_TEST /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TEST*)0xF0208A10u)
/** Alias (User Manual Name) for CAN0_N2_TEST.
* To use register names with standard convension, please use CAN0_N2_TEST.
*/
#define CAN0_TEST2 (CAN0_N2_TEST)

/** \brief A14, RAM Watchdog ${i} */
#define CAN0_N2_RWD /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RWD*)0xF0208A14u)
/** Alias (User Manual Name) for CAN0_N2_RWD.
* To use register names with standard convension, please use CAN0_N2_RWD.
*/
#define CAN0_RWD2 (CAN0_N2_RWD)

/** \brief A18, CC Control Register ${i} */
#define CAN0_N2_CCCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_CCCR*)0xF0208A18u)
/** Alias (User Manual Name) for CAN0_N2_CCCR.
* To use register names with standard convension, please use CAN0_N2_CCCR.
*/
#define CAN0_CCCR2 (CAN0_N2_CCCR)

/** \brief A1C, Nominal Bit Timing & Prescaler Register ${i} */
#define CAN0_N2_NBTP /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NBTP*)0xF0208A1Cu)
/** Alias (User Manual Name) for CAN0_N2_NBTP.
* To use register names with standard convension, please use CAN0_N2_NBTP.
*/
#define CAN0_NBTP2 (CAN0_N2_NBTP)

/** \brief A20, Timestamp Counter Configuration ${i} */
#define CAN0_N2_TSCC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TSCC*)0xF0208A20u)
/** Alias (User Manual Name) for CAN0_N2_TSCC.
* To use register names with standard convension, please use CAN0_N2_TSCC.
*/
#define CAN0_TSCC2 (CAN0_N2_TSCC)

/** \brief A24, Timestamp Counter Value ${i} */
#define CAN0_N2_TSCV /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TSCV*)0xF0208A24u)
/** Alias (User Manual Name) for CAN0_N2_TSCV.
* To use register names with standard convension, please use CAN0_N2_TSCV.
*/
#define CAN0_TSCV2 (CAN0_N2_TSCV)

/** \brief A28, Timeout Counter Configuration ${i} */
#define CAN0_N2_TOCC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TOCC*)0xF0208A28u)
/** Alias (User Manual Name) for CAN0_N2_TOCC.
* To use register names with standard convension, please use CAN0_N2_TOCC.
*/
#define CAN0_TOCC2 (CAN0_N2_TOCC)

