Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_reg.h
/** \brief AC0, Tx Buffer Configuration ${i} */
#define CAN0_N2_TX_BC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BC*)0xF0208AC0u)
/** Alias (User Manual Name) for CAN0_N2_TX_BC.
* To use register names with standard convension, please use CAN0_N2_TX_BC.
*/
#define CAN0_TXBC2 (CAN0_N2_TX_BC)

/** \brief AC4, Tx FIFO/Queue Status ${i} */
#define CAN0_N2_TX_FQS /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_FQS*)0xF0208AC4u)
/** Alias (User Manual Name) for CAN0_N2_TX_FQS.
* To use register names with standard convension, please use CAN0_N2_TX_FQS.
*/
#define CAN0_TXFQS2 (CAN0_N2_TX_FQS)

/** \brief AC8, Tx Buffer Element Size Configuration ${i} */
#define CAN0_N2_TX_ESC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_ESC*)0xF0208AC8u)
/** Alias (User Manual Name) for CAN0_N2_TX_ESC.
* To use register names with standard convension, please use CAN0_N2_TX_ESC.
*/
#define CAN0_TXESC2 (CAN0_N2_TX_ESC)

/** \brief ACC, Tx Buffer Request Pending ${i} */
#define CAN0_N2_TX_BRP /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BRP*)0xF0208ACCu)
/** Alias (User Manual Name) for CAN0_N2_TX_BRP.
* To use register names with standard convension, please use CAN0_N2_TX_BRP.
*/
#define CAN0_TXBRP2 (CAN0_N2_TX_BRP)

/** \brief AD0, Tx Buffer Add Request ${i} */
#define CAN0_N2_TX_BAR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BAR*)0xF0208AD0u)
/** Alias (User Manual Name) for CAN0_N2_TX_BAR.
* To use register names with standard convension, please use CAN0_N2_TX_BAR.
*/
#define CAN0_TXBAR2 (CAN0_N2_TX_BAR)

/** \brief AD4, Tx Buffer Cancellation Request ${i} */
#define CAN0_N2_TX_BCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BCR*)0xF0208AD4u)
/** Alias (User Manual Name) for CAN0_N2_TX_BCR.
* To use register names with standard convension, please use CAN0_N2_TX_BCR.
*/
#define CAN0_TXBCR2 (CAN0_N2_TX_BCR)

/** \brief AD8, Tx Buffer Transmission Occurred ${i} */
#define CAN0_N2_TX_BTO /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BTO*)0xF0208AD8u)
/** Alias (User Manual Name) for CAN0_N2_TX_BTO.
* To use register names with standard convension, please use CAN0_N2_TX_BTO.
*/
#define CAN0_TXBTO2 (CAN0_N2_TX_BTO)

/** \brief ADC, Tx Buffer Cancellation Finished ${i} */
#define CAN0_N2_TX_BCF /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BCF*)0xF0208ADCu)
/** Alias (User Manual Name) for CAN0_N2_TX_BCF.
* To use register names with standard convension, please use CAN0_N2_TX_BCF.
*/
#define CAN0_TXBCF2 (CAN0_N2_TX_BCF)

/** \brief AE0, Tx Buffer Transmission Interrupt Enable ${i} */
#define CAN0_N2_TX_BTIE /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BTIE*)0xF0208AE0u)
/** Alias (User Manual Name) for CAN0_N2_TX_BTIE.
* To use register names with standard convension, please use CAN0_N2_TX_BTIE.
*/
#define CAN0_TXBTIE2 (CAN0_N2_TX_BTIE)

/** \brief AE4, Tx Buffer Cancellation Finished Interrupt Enable ${i} */
#define CAN0_N2_TX_BCIE /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BCIE*)0xF0208AE4u)
/** Alias (User Manual Name) for CAN0_N2_TX_BCIE.
* To use register names with standard convension, please use CAN0_N2_TX_BCIE.
*/
#define CAN0_TXBCIE2 (CAN0_N2_TX_BCIE)

/** \brief AF0, Tx Event FIFO Configuration ${i} */
#define CAN0_N2_TX_EFC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_EFC*)0xF0208AF0u)
/** Alias (User Manual Name) for CAN0_N2_TX_EFC.
* To use register names with standard convension, please use CAN0_N2_TX_EFC.
*/
#define CAN0_TXEFC2 (CAN0_N2_TX_EFC)

/** \brief AF4, Tx Event FIFO Status ${i} */
#define CAN0_N2_TX_EFS /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_EFS*)0xF0208AF4u)
/** Alias (User Manual Name) for CAN0_N2_TX_EFS.
* To use register names with standard convension, please use CAN0_N2_TX_EFS.
*/
#define CAN0_TXEFS2 (CAN0_N2_TX_EFS)

/** \brief AF8, Tx Event FIFO Acknowledge ${i} */
#define CAN0_N2_TX_EFA /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_EFA*)0xF0208AF8u)
/** Alias (User Manual Name) for CAN0_N2_TX_EFA.
* To use register names with standard convension, please use CAN0_N2_TX_EFA.
*/
#define CAN0_TXEFA2 (CAN0_N2_TX_EFA)

/** \brief D00, Access Enable Register CAN Node ${i} 0 */
#define CAN0_N3_ACCENNODE0_ /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ACCENNODE0_*)0xF0208D00u)
/** Alias (User Manual Name) for CAN0_N3_ACCENNODE0_.
* To use register names with standard convension, please use CAN0_N3_ACCENNODE0_.
*/
#define CAN0_ACCENNODE30 (CAN0_N3_ACCENNODE0_)

/** \brief D04, Access Enable Register CAN Node ${i} 1 */
#define CAN0_N3_ACCENNODE1_ /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ACCENNODE1_*)0xF0208D04u)
/** Alias (User Manual Name) for CAN0_N3_ACCENNODE1_.
* To use register names with standard convension, please use CAN0_N3_ACCENNODE1_.
*/
#define CAN0_ACCENNODE31 (CAN0_N3_ACCENNODE1_)

/** \brief D08, Start Address Node ${i} */
#define CAN0_N3_STARTADR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_STARTADR*)0xF0208D08u)
/** Alias (User Manual Name) for CAN0_N3_STARTADR.
* To use register names with standard convension, please use CAN0_N3_STARTADR.
*/
#define CAN0_STARTADR3 (CAN0_N3_STARTADR)

/** \brief D0C, End Address Node ${i} */
#define CAN0_N3_ENDADR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ENDADR*)0xF0208D0Cu)
/** Alias (User Manual Name) for CAN0_N3_ENDADR.
* To use register names with standard convension, please use CAN0_N3_ENDADR.
*/
#define CAN0_ENDADR3 (CAN0_N3_ENDADR)

/** \brief D10, Interrupt Signalling Register ${i} */
#define CAN0_N3_ISREG /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ISREG*)0xF0208D10u)
/** Alias (User Manual Name) for CAN0_N3_ISREG.
* To use register names with standard convension, please use CAN0_N3_ISREG.
*/
#define CAN0_ISREG3 (CAN0_N3_ISREG)

/** \brief D20, Node ${i} Timer Clock Control Register */
#define CAN0_N3_NT_CCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_CCR*)0xF0208D20u)
/** Alias (User Manual Name) for CAN0_N3_NT_CCR.
* To use register names with standard convension, please use CAN0_N3_NT_CCR.
*/
#define CAN0_NTCCR3 (CAN0_N3_NT_CCR)

/** \brief D24, Node ${i} Timer A Transmit Trigger Register */
#define CAN0_N3_NT_ATTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_ATTR*)0xF0208D24u)
/** Alias (User Manual Name) for CAN0_N3_NT_ATTR.
* To use register names with standard convension, please use CAN0_N3_NT_ATTR.
*/
#define CAN0_NTATTR3 (CAN0_N3_NT_ATTR)

/** \brief D28, Node ${i} Timer B Transmit Trigger Register */
#define CAN0_N3_NT_BTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_BTTR*)0xF0208D28u)
/** Alias (User Manual Name) for CAN0_N3_NT_BTTR.
* To use register names with standard convension, please use CAN0_N3_NT_BTTR.
*/
#define CAN0_NTBTTR3 (CAN0_N3_NT_BTTR)

