Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_reg.h
/** \brief EA0, Rx FIFO 0 Configuration ${i} */
#define CAN0_N3_RX_F0C /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_F0C*)0xF0208EA0u)
/** Alias (User Manual Name) for CAN0_N3_RX_F0C.
* To use register names with standard convension, please use CAN0_N3_RX_F0C.
*/
#define CAN0_RXF0C3 (CAN0_N3_RX_F0C)

/** \brief EA4, Rx FIFO 0 Status ${i} */
#define CAN0_N3_RX_F0S /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_F0S*)0xF0208EA4u)
/** Alias (User Manual Name) for CAN0_N3_RX_F0S.
* To use register names with standard convension, please use CAN0_N3_RX_F0S.
*/
#define CAN0_RXF0S3 (CAN0_N3_RX_F0S)

/** \brief EA8, Rx FIFO 0 Acknowledge ${i} */
#define CAN0_N3_RX_F0A /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_F0A*)0xF0208EA8u)
/** Alias (User Manual Name) for CAN0_N3_RX_F0A.
* To use register names with standard convension, please use CAN0_N3_RX_F0A.
*/
#define CAN0_RXF0A3 (CAN0_N3_RX_F0A)

/** \brief EAC, Rx Buffer Configuration ${i} */
#define CAN0_N3_RX_BC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_BC*)0xF0208EACu)
/** Alias (User Manual Name) for CAN0_N3_RX_BC.
* To use register names with standard convension, please use CAN0_N3_RX_BC.
*/
#define CAN0_RXBC3 (CAN0_N3_RX_BC)

/** \brief EB0, Rx FIFO 1 Configuration ${i} */
#define CAN0_N3_RX_F1C /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_F1C*)0xF0208EB0u)
/** Alias (User Manual Name) for CAN0_N3_RX_F1C.
* To use register names with standard convension, please use CAN0_N3_RX_F1C.
*/
#define CAN0_RXF1C3 (CAN0_N3_RX_F1C)

/** \brief EB4, Rx FIFO 1 Status ${i} */
#define CAN0_N3_RX_F1S /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_F1S*)0xF0208EB4u)
/** Alias (User Manual Name) for CAN0_N3_RX_F1S.
* To use register names with standard convension, please use CAN0_N3_RX_F1S.
*/
#define CAN0_RXF1S3 (CAN0_N3_RX_F1S)

/** \brief EB8, Rx FIFO 1 Acknowledge ${i} */
#define CAN0_N3_RX_F1A /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_F1A*)0xF0208EB8u)
/** Alias (User Manual Name) for CAN0_N3_RX_F1A.
* To use register names with standard convension, please use CAN0_N3_RX_F1A.
*/
#define CAN0_RXF1A3 (CAN0_N3_RX_F1A)

/** \brief EBC, Rx Buffer/FIFO Element Size Configuration ${i} */
#define CAN0_N3_RX_ESC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_ESC*)0xF0208EBCu)
/** Alias (User Manual Name) for CAN0_N3_RX_ESC.
* To use register names with standard convension, please use CAN0_N3_RX_ESC.
*/
#define CAN0_RXESC3 (CAN0_N3_RX_ESC)

/** \brief EC0, Tx Buffer Configuration ${i} */
#define CAN0_N3_TX_BC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BC*)0xF0208EC0u)
/** Alias (User Manual Name) for CAN0_N3_TX_BC.
* To use register names with standard convension, please use CAN0_N3_TX_BC.
*/
#define CAN0_TXBC3 (CAN0_N3_TX_BC)

/** \brief EC4, Tx FIFO/Queue Status ${i} */
#define CAN0_N3_TX_FQS /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_FQS*)0xF0208EC4u)
/** Alias (User Manual Name) for CAN0_N3_TX_FQS.
* To use register names with standard convension, please use CAN0_N3_TX_FQS.
*/
#define CAN0_TXFQS3 (CAN0_N3_TX_FQS)

/** \brief EC8, Tx Buffer Element Size Configuration ${i} */
#define CAN0_N3_TX_ESC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_ESC*)0xF0208EC8u)
/** Alias (User Manual Name) for CAN0_N3_TX_ESC.
* To use register names with standard convension, please use CAN0_N3_TX_ESC.
*/
#define CAN0_TXESC3 (CAN0_N3_TX_ESC)

/** \brief ECC, Tx Buffer Request Pending ${i} */
#define CAN0_N3_TX_BRP /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BRP*)0xF0208ECCu)
/** Alias (User Manual Name) for CAN0_N3_TX_BRP.
* To use register names with standard convension, please use CAN0_N3_TX_BRP.
*/
#define CAN0_TXBRP3 (CAN0_N3_TX_BRP)

/** \brief ED0, Tx Buffer Add Request ${i} */
#define CAN0_N3_TX_BAR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BAR*)0xF0208ED0u)
/** Alias (User Manual Name) for CAN0_N3_TX_BAR.
* To use register names with standard convension, please use CAN0_N3_TX_BAR.
*/
#define CAN0_TXBAR3 (CAN0_N3_TX_BAR)

/** \brief ED4, Tx Buffer Cancellation Request ${i} */
#define CAN0_N3_TX_BCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BCR*)0xF0208ED4u)
/** Alias (User Manual Name) for CAN0_N3_TX_BCR.
* To use register names with standard convension, please use CAN0_N3_TX_BCR.
*/
#define CAN0_TXBCR3 (CAN0_N3_TX_BCR)

/** \brief ED8, Tx Buffer Transmission Occurred ${i} */
#define CAN0_N3_TX_BTO /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BTO*)0xF0208ED8u)
/** Alias (User Manual Name) for CAN0_N3_TX_BTO.
* To use register names with standard convension, please use CAN0_N3_TX_BTO.
*/
#define CAN0_TXBTO3 (CAN0_N3_TX_BTO)

/** \brief EDC, Tx Buffer Cancellation Finished ${i} */
#define CAN0_N3_TX_BCF /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BCF*)0xF0208EDCu)
/** Alias (User Manual Name) for CAN0_N3_TX_BCF.
* To use register names with standard convension, please use CAN0_N3_TX_BCF.
*/
#define CAN0_TXBCF3 (CAN0_N3_TX_BCF)

/** \brief EE0, Tx Buffer Transmission Interrupt Enable ${i} */
#define CAN0_N3_TX_BTIE /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BTIE*)0xF0208EE0u)
/** Alias (User Manual Name) for CAN0_N3_TX_BTIE.
* To use register names with standard convension, please use CAN0_N3_TX_BTIE.
*/
#define CAN0_TXBTIE3 (CAN0_N3_TX_BTIE)

/** \brief EE4, Tx Buffer Cancellation Finished Interrupt Enable ${i} */
#define CAN0_N3_TX_BCIE /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BCIE*)0xF0208EE4u)
/** Alias (User Manual Name) for CAN0_N3_TX_BCIE.
* To use register names with standard convension, please use CAN0_N3_TX_BCIE.
*/
#define CAN0_TXBCIE3 (CAN0_N3_TX_BCIE)

/** \brief EF0, Tx Event FIFO Configuration ${i} */
#define CAN0_N3_TX_EFC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_EFC*)0xF0208EF0u)
/** Alias (User Manual Name) for CAN0_N3_TX_EFC.
* To use register names with standard convension, please use CAN0_N3_TX_EFC.
*/
#define CAN0_TXEFC3 (CAN0_N3_TX_EFC)

/** \brief EF4, Tx Event FIFO Status ${i} */
#define CAN0_N3_TX_EFS /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_EFS*)0xF0208EF4u)
/** Alias (User Manual Name) for CAN0_N3_TX_EFS.
* To use register names with standard convension, please use CAN0_N3_TX_EFS.
*/
#define CAN0_TXEFS3 (CAN0_N3_TX_EFS)

