Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_reg.h
/** \brief EF8, Tx Event FIFO Acknowledge ${i} */
#define CAN0_N3_TX_EFA /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_EFA*)0xF0208EF8u)
/** Alias (User Manual Name) for CAN0_N3_TX_EFA.
* To use register names with standard convension, please use CAN0_N3_TX_EFA.
*/
#define CAN0_TXEFA3 (CAN0_N3_TX_EFA)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Can_Cfg_Can1
 * \{  */
/** \brief 0, CAN Clock Control Register */
#define CAN1_CLC /*lint --e(923)*/ (*(volatile Ifx_CAN_CLC*)0xF0218000u)

/** \brief 8, Module Identification Register */
#define CAN1_ID /*lint --e(923)*/ (*(volatile Ifx_CAN_ID*)0xF0218008u)

/** \brief 20, Interrupt routing for Groups 1 */
#define CAN1_GRINT1 /*lint --e(923)*/ (*(volatile Ifx_CAN_GRINT1*)0xF0218020u)

/** \brief 24, Interrupt routing for Groups 2 */
#define CAN1_GRINT2 /*lint --e(923)*/ (*(volatile Ifx_CAN_GRINT2*)0xF0218024u)

/** \brief 30, Module Control Register */
#define CAN1_MCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MCR*)0xF0218030u)

/** \brief D8, Access Enable Register CTR 1 */
#define CAN1_ACCENCTR1 /*lint --e(923)*/ (*(volatile Ifx_CAN_ACCENCTR1*)0xF02180D8u)

/** \brief DC, Access Enable Register Control 0 */
#define CAN1_ACCENCTR0 /*lint --e(923)*/ (*(volatile Ifx_CAN_ACCENCTR0*)0xF02180DCu)

/** \brief E8, OCDS Control and Status */
#define CAN1_OCS /*lint --e(923)*/ (*(volatile Ifx_CAN_OCS*)0xF02180E8u)

/** \brief EC, Kernel Reset Status Clear Register */
#define CAN1_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_CAN_KRSTCLR*)0xF02180ECu)

/** \brief F0, Kernel Reset Register 1 */
#define CAN1_KRST1 /*lint --e(923)*/ (*(volatile Ifx_CAN_KRST1*)0xF02180F0u)

/** \brief F4, Kernel Reset Register 0 */
#define CAN1_KRST0 /*lint --e(923)*/ (*(volatile Ifx_CAN_KRST0*)0xF02180F4u)

/** \brief F8, Access Enable Register 1 */
#define CAN1_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_CAN_ACCEN1*)0xF02180F8u)

/** \brief FC, Access Enable Register 0 */
#define CAN1_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_CAN_ACCEN0*)0xF02180FCu)

/** \brief 100, Access Enable Register CAN Node ${i} 0 */
#define CAN1_N0_ACCENNODE0_ /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ACCENNODE0_*)0xF0218100u)
/** Alias (User Manual Name) for CAN1_N0_ACCENNODE0_.
* To use register names with standard convension, please use CAN1_N0_ACCENNODE0_.
*/
#define CAN1_ACCENNODE00 (CAN1_N0_ACCENNODE0_)

/** \brief 104, Access Enable Register CAN Node ${i} 1 */
#define CAN1_N0_ACCENNODE1_ /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ACCENNODE1_*)0xF0218104u)
/** Alias (User Manual Name) for CAN1_N0_ACCENNODE1_.
* To use register names with standard convension, please use CAN1_N0_ACCENNODE1_.
*/
#define CAN1_ACCENNODE01 (CAN1_N0_ACCENNODE1_)

/** \brief 108, Start Address Node ${i} */
#define CAN1_N0_STARTADR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_STARTADR*)0xF0218108u)
/** Alias (User Manual Name) for CAN1_N0_STARTADR.
* To use register names with standard convension, please use CAN1_N0_STARTADR.
*/
#define CAN1_STARTADR0 (CAN1_N0_STARTADR)

/** \brief 10C, End Address Node ${i} */
#define CAN1_N0_ENDADR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ENDADR*)0xF021810Cu)
/** Alias (User Manual Name) for CAN1_N0_ENDADR.
* To use register names with standard convension, please use CAN1_N0_ENDADR.
*/
#define CAN1_ENDADR0 (CAN1_N0_ENDADR)

/** \brief 110, Interrupt Signalling Register ${i} */
#define CAN1_N0_ISREG /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ISREG*)0xF0218110u)
/** Alias (User Manual Name) for CAN1_N0_ISREG.
* To use register names with standard convension, please use CAN1_N0_ISREG.
*/
#define CAN1_ISREG0 (CAN1_N0_ISREG)

/** \brief 120, Node ${i} Timer Clock Control Register */
#define CAN1_N0_NT_CCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_CCR*)0xF0218120u)
/** Alias (User Manual Name) for CAN1_N0_NT_CCR.
* To use register names with standard convension, please use CAN1_N0_NT_CCR.
*/
#define CAN1_NTCCR0 (CAN1_N0_NT_CCR)

/** \brief 124, Node ${i} Timer A Transmit Trigger Register */
#define CAN1_N0_NT_ATTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_ATTR*)0xF0218124u)
/** Alias (User Manual Name) for CAN1_N0_NT_ATTR.
* To use register names with standard convension, please use CAN1_N0_NT_ATTR.
*/
#define CAN1_NTATTR0 (CAN1_N0_NT_ATTR)

/** \brief 128, Node ${i} Timer B Transmit Trigger Register */
#define CAN1_N0_NT_BTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_BTTR*)0xF0218128u)
/** Alias (User Manual Name) for CAN1_N0_NT_BTTR.
* To use register names with standard convension, please use CAN1_N0_NT_BTTR.
*/
#define CAN1_NTBTTR0 (CAN1_N0_NT_BTTR)

/** \brief 12C, Node ${i} Timer C Transmit Trigger Register */
#define CAN1_N0_NT_CTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_CTTR*)0xF021812Cu)
/** Alias (User Manual Name) for CAN1_N0_NT_CTTR.
* To use register names with standard convension, please use CAN1_N0_NT_CTTR.
*/
#define CAN1_NTCTTR0 (CAN1_N0_NT_CTTR)

/** \brief 130, Node ${i} Timer Receive Timeout Register */
#define CAN1_N0_NT_RTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_RTR*)0xF0218130u)
/** Alias (User Manual Name) for CAN1_N0_NT_RTR.
* To use register names with standard convension, please use CAN1_N0_NT_RTR.
*/
#define CAN1_NTRTR0 (CAN1_N0_NT_RTR)

/** \brief 140, Node ${i} Port Control Register */
#define CAN1_N0_NPCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NPCR*)0xF0218140u)
/** Alias (User Manual Name) for CAN1_N0_NPCR.
* To use register names with standard convension, please use CAN1_N0_NPCR.
*/
#define CAN1_NPCR0 (CAN1_N0_NPCR)

/** \brief 200, Core Release Register ${i} */
#define CAN1_N0_CREL /*lint --e(923)*/ (*(volatile Ifx_CAN_N_CREL*)0xF0218200u)
/** Alias (User Manual Name) for CAN1_N0_CREL.
* To use register names with standard convension, please use CAN1_N0_CREL.
*/
#define CAN1_CREL0 (CAN1_N0_CREL)

/** \brief 204, Endian Register ${i} */
#define CAN1_N0_ENDN /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ENDN*)0xF0218204u)
/** Alias (User Manual Name) for CAN1_N0_ENDN.
* To use register names with standard convension, please use CAN1_N0_ENDN.
*/
#define CAN1_ENDN0 (CAN1_N0_ENDN)

