Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_reg.h
/** \brief 20C, Data Bit Timing & Prescaler Register ${i} */
#define CAN1_N0_DBTP /*lint --e(923)*/ (*(volatile Ifx_CAN_N_DBTP*)0xF021820Cu)
/** Alias (User Manual Name) for CAN1_N0_DBTP.
* To use register names with standard convension, please use CAN1_N0_DBTP.
*/
#define CAN1_DBTP0 (CAN1_N0_DBTP)

/** \brief 210, Test Register ${i} */
#define CAN1_N0_TEST /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TEST*)0xF0218210u)
/** Alias (User Manual Name) for CAN1_N0_TEST.
* To use register names with standard convension, please use CAN1_N0_TEST.
*/
#define CAN1_TEST0 (CAN1_N0_TEST)

/** \brief 214, RAM Watchdog ${i} */
#define CAN1_N0_RWD /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RWD*)0xF0218214u)
/** Alias (User Manual Name) for CAN1_N0_RWD.
* To use register names with standard convension, please use CAN1_N0_RWD.
*/
#define CAN1_RWD0 (CAN1_N0_RWD)

/** \brief 218, CC Control Register ${i} */
#define CAN1_N0_CCCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_CCCR*)0xF0218218u)
/** Alias (User Manual Name) for CAN1_N0_CCCR.
* To use register names with standard convension, please use CAN1_N0_CCCR.
*/
#define CAN1_CCCR0 (CAN1_N0_CCCR)

/** \brief 21C, Nominal Bit Timing & Prescaler Register ${i} */
#define CAN1_N0_NBTP /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NBTP*)0xF021821Cu)
/** Alias (User Manual Name) for CAN1_N0_NBTP.
* To use register names with standard convension, please use CAN1_N0_NBTP.
*/
#define CAN1_NBTP0 (CAN1_N0_NBTP)

/** \brief 220, Timestamp Counter Configuration ${i} */
#define CAN1_N0_TSCC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TSCC*)0xF0218220u)
/** Alias (User Manual Name) for CAN1_N0_TSCC.
* To use register names with standard convension, please use CAN1_N0_TSCC.
*/
#define CAN1_TSCC0 (CAN1_N0_TSCC)

/** \brief 224, Timestamp Counter Value ${i} */
#define CAN1_N0_TSCV /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TSCV*)0xF0218224u)
/** Alias (User Manual Name) for CAN1_N0_TSCV.
* To use register names with standard convension, please use CAN1_N0_TSCV.
*/
#define CAN1_TSCV0 (CAN1_N0_TSCV)

/** \brief 228, Timeout Counter Configuration ${i} */
#define CAN1_N0_TOCC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TOCC*)0xF0218228u)
/** Alias (User Manual Name) for CAN1_N0_TOCC.
* To use register names with standard convension, please use CAN1_N0_TOCC.
*/
#define CAN1_TOCC0 (CAN1_N0_TOCC)

/** \brief 22C, Timeout Counter Value ${i} */
#define CAN1_N0_TOCV /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TOCV*)0xF021822Cu)
/** Alias (User Manual Name) for CAN1_N0_TOCV.
* To use register names with standard convension, please use CAN1_N0_TOCV.
*/
#define CAN1_TOCV0 (CAN1_N0_TOCV)

/** \brief 240, Error Counter Register ${i} */
#define CAN1_N0_ECR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ECR*)0xF0218240u)
/** Alias (User Manual Name) for CAN1_N0_ECR.
* To use register names with standard convension, please use CAN1_N0_ECR.
*/
#define CAN1_ECR0 (CAN1_N0_ECR)

/** \brief 244, Protocol Status Register ${i} */
#define CAN1_N0_PSR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_PSR*)0xF0218244u)
/** Alias (User Manual Name) for CAN1_N0_PSR.
* To use register names with standard convension, please use CAN1_N0_PSR.
*/
#define CAN1_PSR0 (CAN1_N0_PSR)

/** \brief 248, Transmitter Delay Compensation Register ${i} */
#define CAN1_N0_TDCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TDCR*)0xF0218248u)
/** Alias (User Manual Name) for CAN1_N0_TDCR.
* To use register names with standard convension, please use CAN1_N0_TDCR.
*/
#define CAN1_TDCR0 (CAN1_N0_TDCR)

/** \brief 250, Interrupt Register ${i} */
#define CAN1_N0_IR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IR*)0xF0218250u)
/** Alias (User Manual Name) for CAN1_N0_IR.
* To use register names with standard convension, please use CAN1_N0_IR.
*/
#define CAN1_IR0 (CAN1_N0_IR)

/** \brief 254, Interrupt Enable ${i} */
#define CAN1_N0_IE /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IE*)0xF0218254u)
/** Alias (User Manual Name) for CAN1_N0_IE.
* To use register names with standard convension, please use CAN1_N0_IE.
*/
#define CAN1_IE0 (CAN1_N0_IE)

/** \brief 280, Global Filter Configuration ${i} */
#define CAN1_N0_GFC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_GFC*)0xF0218280u)
/** Alias (User Manual Name) for CAN1_N0_GFC.
* To use register names with standard convension, please use CAN1_N0_GFC.
*/
#define CAN1_GFC0 (CAN1_N0_GFC)

/** \brief 284, Standard ID Filter Configuration ${i} */
#define CAN1_N0_SIDFC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_SIDFC*)0xF0218284u)
/** Alias (User Manual Name) for CAN1_N0_SIDFC.
* To use register names with standard convension, please use CAN1_N0_SIDFC.
*/
#define CAN1_SIDFC0 (CAN1_N0_SIDFC)

/** \brief 288, Extended ID Filter Configuration ${i} */
#define CAN1_N0_XIDFC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_XIDFC*)0xF0218288u)
/** Alias (User Manual Name) for CAN1_N0_XIDFC.
* To use register names with standard convension, please use CAN1_N0_XIDFC.
*/
#define CAN1_XIDFC0 (CAN1_N0_XIDFC)

/** \brief 290, Extended ID AND Mask ${i} */
#define CAN1_N0_XIDAM /*lint --e(923)*/ (*(volatile Ifx_CAN_N_XIDAM*)0xF0218290u)
/** Alias (User Manual Name) for CAN1_N0_XIDAM.
* To use register names with standard convension, please use CAN1_N0_XIDAM.
*/
#define CAN1_XIDAM0 (CAN1_N0_XIDAM)

/** \brief 294, High Priority Message Status ${i} */
#define CAN1_N0_HPMS /*lint --e(923)*/ (*(volatile Ifx_CAN_N_HPMS*)0xF0218294u)
/** Alias (User Manual Name) for CAN1_N0_HPMS.
* To use register names with standard convension, please use CAN1_N0_HPMS.
*/
#define CAN1_HPMS0 (CAN1_N0_HPMS)

/** \brief 298, New Data 1 ${i} */
#define CAN1_N0_NDAT1 /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NDAT1*)0xF0218298u)
/** Alias (User Manual Name) for CAN1_N0_NDAT1.
* To use register names with standard convension, please use CAN1_N0_NDAT1.
*/
#define CAN1_NDAT10 (CAN1_N0_NDAT1)

/** \brief 29C, New Data 2 ${i} */
#define CAN1_N0_NDAT2 /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NDAT2*)0xF021829Cu)
/** Alias (User Manual Name) for CAN1_N0_NDAT2.
* To use register names with standard convension, please use CAN1_N0_NDAT2.
*/
#define CAN1_NDAT20 (CAN1_N0_NDAT2)

/** \brief 2A0, Rx FIFO 0 Configuration ${i} */
#define CAN1_N0_RX_F0C /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_F0C*)0xF02182A0u)
/** Alias (User Manual Name) for CAN1_N0_RX_F0C.
* To use register names with standard convension, please use CAN1_N0_RX_F0C.
*/
#define CAN1_RXF0C0 (CAN1_N0_RX_F0C)

/** \brief 2A4, Rx FIFO 0 Status ${i} */
#define CAN1_N0_RX_F0S /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_F0S*)0xF02182A4u)
/** Alias (User Manual Name) for CAN1_N0_RX_F0S.
* To use register names with standard convension, please use CAN1_N0_RX_F0S.
*/
#define CAN1_RXF0S0 (CAN1_N0_RX_F0S)

