Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_reg.h
/** \brief 524, Node ${i} Timer A Transmit Trigger Register */
#define CAN1_N1_NT_ATTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_ATTR*)0xF0218524u)
/** Alias (User Manual Name) for CAN1_N1_NT_ATTR.
* To use register names with standard convension, please use CAN1_N1_NT_ATTR.
*/
#define CAN1_NTATTR1 (CAN1_N1_NT_ATTR)

/** \brief 528, Node ${i} Timer B Transmit Trigger Register */
#define CAN1_N1_NT_BTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_BTTR*)0xF0218528u)
/** Alias (User Manual Name) for CAN1_N1_NT_BTTR.
* To use register names with standard convension, please use CAN1_N1_NT_BTTR.
*/
#define CAN1_NTBTTR1 (CAN1_N1_NT_BTTR)

/** \brief 52C, Node ${i} Timer C Transmit Trigger Register */
#define CAN1_N1_NT_CTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_CTTR*)0xF021852Cu)
/** Alias (User Manual Name) for CAN1_N1_NT_CTTR.
* To use register names with standard convension, please use CAN1_N1_NT_CTTR.
*/
#define CAN1_NTCTTR1 (CAN1_N1_NT_CTTR)

/** \brief 530, Node ${i} Timer Receive Timeout Register */
#define CAN1_N1_NT_RTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_RTR*)0xF0218530u)
/** Alias (User Manual Name) for CAN1_N1_NT_RTR.
* To use register names with standard convension, please use CAN1_N1_NT_RTR.
*/
#define CAN1_NTRTR1 (CAN1_N1_NT_RTR)

/** \brief 540, Node ${i} Port Control Register */
#define CAN1_N1_NPCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NPCR*)0xF0218540u)
/** Alias (User Manual Name) for CAN1_N1_NPCR.
* To use register names with standard convension, please use CAN1_N1_NPCR.
*/
#define CAN1_NPCR1 (CAN1_N1_NPCR)

/** \brief 600, Core Release Register ${i} */
#define CAN1_N1_CREL /*lint --e(923)*/ (*(volatile Ifx_CAN_N_CREL*)0xF0218600u)
/** Alias (User Manual Name) for CAN1_N1_CREL.
* To use register names with standard convension, please use CAN1_N1_CREL.
*/
#define CAN1_CREL1 (CAN1_N1_CREL)

/** \brief 604, Endian Register ${i} */
#define CAN1_N1_ENDN /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ENDN*)0xF0218604u)
/** Alias (User Manual Name) for CAN1_N1_ENDN.
* To use register names with standard convension, please use CAN1_N1_ENDN.
*/
#define CAN1_ENDN1 (CAN1_N1_ENDN)

/** \brief 60C, Data Bit Timing & Prescaler Register ${i} */
#define CAN1_N1_DBTP /*lint --e(923)*/ (*(volatile Ifx_CAN_N_DBTP*)0xF021860Cu)
/** Alias (User Manual Name) for CAN1_N1_DBTP.
* To use register names with standard convension, please use CAN1_N1_DBTP.
*/
#define CAN1_DBTP1 (CAN1_N1_DBTP)

/** \brief 610, Test Register ${i} */
#define CAN1_N1_TEST /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TEST*)0xF0218610u)
/** Alias (User Manual Name) for CAN1_N1_TEST.
* To use register names with standard convension, please use CAN1_N1_TEST.
*/
#define CAN1_TEST1 (CAN1_N1_TEST)

/** \brief 614, RAM Watchdog ${i} */
#define CAN1_N1_RWD /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RWD*)0xF0218614u)
/** Alias (User Manual Name) for CAN1_N1_RWD.
* To use register names with standard convension, please use CAN1_N1_RWD.
*/
#define CAN1_RWD1 (CAN1_N1_RWD)

/** \brief 618, CC Control Register ${i} */
#define CAN1_N1_CCCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_CCCR*)0xF0218618u)
/** Alias (User Manual Name) for CAN1_N1_CCCR.
* To use register names with standard convension, please use CAN1_N1_CCCR.
*/
#define CAN1_CCCR1 (CAN1_N1_CCCR)

/** \brief 61C, Nominal Bit Timing & Prescaler Register ${i} */
#define CAN1_N1_NBTP /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NBTP*)0xF021861Cu)
/** Alias (User Manual Name) for CAN1_N1_NBTP.
* To use register names with standard convension, please use CAN1_N1_NBTP.
*/
#define CAN1_NBTP1 (CAN1_N1_NBTP)

/** \brief 620, Timestamp Counter Configuration ${i} */
#define CAN1_N1_TSCC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TSCC*)0xF0218620u)
/** Alias (User Manual Name) for CAN1_N1_TSCC.
* To use register names with standard convension, please use CAN1_N1_TSCC.
*/
#define CAN1_TSCC1 (CAN1_N1_TSCC)

/** \brief 624, Timestamp Counter Value ${i} */
#define CAN1_N1_TSCV /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TSCV*)0xF0218624u)
/** Alias (User Manual Name) for CAN1_N1_TSCV.
* To use register names with standard convension, please use CAN1_N1_TSCV.
*/
#define CAN1_TSCV1 (CAN1_N1_TSCV)

/** \brief 628, Timeout Counter Configuration ${i} */
#define CAN1_N1_TOCC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TOCC*)0xF0218628u)
/** Alias (User Manual Name) for CAN1_N1_TOCC.
* To use register names with standard convension, please use CAN1_N1_TOCC.
*/
#define CAN1_TOCC1 (CAN1_N1_TOCC)

/** \brief 62C, Timeout Counter Value ${i} */
#define CAN1_N1_TOCV /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TOCV*)0xF021862Cu)
/** Alias (User Manual Name) for CAN1_N1_TOCV.
* To use register names with standard convension, please use CAN1_N1_TOCV.
*/
#define CAN1_TOCV1 (CAN1_N1_TOCV)

/** \brief 640, Error Counter Register ${i} */
#define CAN1_N1_ECR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ECR*)0xF0218640u)
/** Alias (User Manual Name) for CAN1_N1_ECR.
* To use register names with standard convension, please use CAN1_N1_ECR.
*/
#define CAN1_ECR1 (CAN1_N1_ECR)

/** \brief 644, Protocol Status Register ${i} */
#define CAN1_N1_PSR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_PSR*)0xF0218644u)
/** Alias (User Manual Name) for CAN1_N1_PSR.
* To use register names with standard convension, please use CAN1_N1_PSR.
*/
#define CAN1_PSR1 (CAN1_N1_PSR)

/** \brief 648, Transmitter Delay Compensation Register ${i} */
#define CAN1_N1_TDCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TDCR*)0xF0218648u)
/** Alias (User Manual Name) for CAN1_N1_TDCR.
* To use register names with standard convension, please use CAN1_N1_TDCR.
*/
#define CAN1_TDCR1 (CAN1_N1_TDCR)

/** \brief 650, Interrupt Register ${i} */
#define CAN1_N1_IR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IR*)0xF0218650u)
/** Alias (User Manual Name) for CAN1_N1_IR.
* To use register names with standard convension, please use CAN1_N1_IR.
*/
#define CAN1_IR1 (CAN1_N1_IR)

/** \brief 654, Interrupt Enable ${i} */
#define CAN1_N1_IE /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IE*)0xF0218654u)
/** Alias (User Manual Name) for CAN1_N1_IE.
* To use register names with standard convension, please use CAN1_N1_IE.
*/
#define CAN1_IE1 (CAN1_N1_IE)

