Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_reg.h
/** \brief 680, Global Filter Configuration ${i} */
#define CAN1_N1_GFC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_GFC*)0xF0218680u)
/** Alias (User Manual Name) for CAN1_N1_GFC.
* To use register names with standard convension, please use CAN1_N1_GFC.
*/
#define CAN1_GFC1 (CAN1_N1_GFC)

/** \brief 684, Standard ID Filter Configuration ${i} */
#define CAN1_N1_SIDFC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_SIDFC*)0xF0218684u)
/** Alias (User Manual Name) for CAN1_N1_SIDFC.
* To use register names with standard convension, please use CAN1_N1_SIDFC.
*/
#define CAN1_SIDFC1 (CAN1_N1_SIDFC)

/** \brief 688, Extended ID Filter Configuration ${i} */
#define CAN1_N1_XIDFC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_XIDFC*)0xF0218688u)
/** Alias (User Manual Name) for CAN1_N1_XIDFC.
* To use register names with standard convension, please use CAN1_N1_XIDFC.
*/
#define CAN1_XIDFC1 (CAN1_N1_XIDFC)

/** \brief 690, Extended ID AND Mask ${i} */
#define CAN1_N1_XIDAM /*lint --e(923)*/ (*(volatile Ifx_CAN_N_XIDAM*)0xF0218690u)
/** Alias (User Manual Name) for CAN1_N1_XIDAM.
* To use register names with standard convension, please use CAN1_N1_XIDAM.
*/
#define CAN1_XIDAM1 (CAN1_N1_XIDAM)

/** \brief 694, High Priority Message Status ${i} */
#define CAN1_N1_HPMS /*lint --e(923)*/ (*(volatile Ifx_CAN_N_HPMS*)0xF0218694u)
/** Alias (User Manual Name) for CAN1_N1_HPMS.
* To use register names with standard convension, please use CAN1_N1_HPMS.
*/
#define CAN1_HPMS1 (CAN1_N1_HPMS)

/** \brief 698, New Data 1 ${i} */
#define CAN1_N1_NDAT1 /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NDAT1*)0xF0218698u)
/** Alias (User Manual Name) for CAN1_N1_NDAT1.
* To use register names with standard convension, please use CAN1_N1_NDAT1.
*/
#define CAN1_NDAT11 (CAN1_N1_NDAT1)

/** \brief 69C, New Data 2 ${i} */
#define CAN1_N1_NDAT2 /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NDAT2*)0xF021869Cu)
/** Alias (User Manual Name) for CAN1_N1_NDAT2.
* To use register names with standard convension, please use CAN1_N1_NDAT2.
*/
#define CAN1_NDAT21 (CAN1_N1_NDAT2)

/** \brief 6A0, Rx FIFO 0 Configuration ${i} */
#define CAN1_N1_RX_F0C /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_F0C*)0xF02186A0u)
/** Alias (User Manual Name) for CAN1_N1_RX_F0C.
* To use register names with standard convension, please use CAN1_N1_RX_F0C.
*/
#define CAN1_RXF0C1 (CAN1_N1_RX_F0C)

/** \brief 6A4, Rx FIFO 0 Status ${i} */
#define CAN1_N1_RX_F0S /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_F0S*)0xF02186A4u)
/** Alias (User Manual Name) for CAN1_N1_RX_F0S.
* To use register names with standard convension, please use CAN1_N1_RX_F0S.
*/
#define CAN1_RXF0S1 (CAN1_N1_RX_F0S)

/** \brief 6A8, Rx FIFO 0 Acknowledge ${i} */
#define CAN1_N1_RX_F0A /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_F0A*)0xF02186A8u)
/** Alias (User Manual Name) for CAN1_N1_RX_F0A.
* To use register names with standard convension, please use CAN1_N1_RX_F0A.
*/
#define CAN1_RXF0A1 (CAN1_N1_RX_F0A)

/** \brief 6AC, Rx Buffer Configuration ${i} */
#define CAN1_N1_RX_BC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_BC*)0xF02186ACu)
/** Alias (User Manual Name) for CAN1_N1_RX_BC.
* To use register names with standard convension, please use CAN1_N1_RX_BC.
*/
#define CAN1_RXBC1 (CAN1_N1_RX_BC)

/** \brief 6B0, Rx FIFO 1 Configuration ${i} */
#define CAN1_N1_RX_F1C /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_F1C*)0xF02186B0u)
/** Alias (User Manual Name) for CAN1_N1_RX_F1C.
* To use register names with standard convension, please use CAN1_N1_RX_F1C.
*/
#define CAN1_RXF1C1 (CAN1_N1_RX_F1C)

/** \brief 6B4, Rx FIFO 1 Status ${i} */
#define CAN1_N1_RX_F1S /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_F1S*)0xF02186B4u)
/** Alias (User Manual Name) for CAN1_N1_RX_F1S.
* To use register names with standard convension, please use CAN1_N1_RX_F1S.
*/
#define CAN1_RXF1S1 (CAN1_N1_RX_F1S)

/** \brief 6B8, Rx FIFO 1 Acknowledge ${i} */
#define CAN1_N1_RX_F1A /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_F1A*)0xF02186B8u)
/** Alias (User Manual Name) for CAN1_N1_RX_F1A.
* To use register names with standard convension, please use CAN1_N1_RX_F1A.
*/
#define CAN1_RXF1A1 (CAN1_N1_RX_F1A)

/** \brief 6BC, Rx Buffer/FIFO Element Size Configuration ${i} */
#define CAN1_N1_RX_ESC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_ESC*)0xF02186BCu)
/** Alias (User Manual Name) for CAN1_N1_RX_ESC.
* To use register names with standard convension, please use CAN1_N1_RX_ESC.
*/
#define CAN1_RXESC1 (CAN1_N1_RX_ESC)

/** \brief 6C0, Tx Buffer Configuration ${i} */
#define CAN1_N1_TX_BC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BC*)0xF02186C0u)
/** Alias (User Manual Name) for CAN1_N1_TX_BC.
* To use register names with standard convension, please use CAN1_N1_TX_BC.
*/
#define CAN1_TXBC1 (CAN1_N1_TX_BC)

/** \brief 6C4, Tx FIFO/Queue Status ${i} */
#define CAN1_N1_TX_FQS /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_FQS*)0xF02186C4u)
/** Alias (User Manual Name) for CAN1_N1_TX_FQS.
* To use register names with standard convension, please use CAN1_N1_TX_FQS.
*/
#define CAN1_TXFQS1 (CAN1_N1_TX_FQS)

/** \brief 6C8, Tx Buffer Element Size Configuration ${i} */
#define CAN1_N1_TX_ESC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_ESC*)0xF02186C8u)
/** Alias (User Manual Name) for CAN1_N1_TX_ESC.
* To use register names with standard convension, please use CAN1_N1_TX_ESC.
*/
#define CAN1_TXESC1 (CAN1_N1_TX_ESC)

/** \brief 6CC, Tx Buffer Request Pending ${i} */
#define CAN1_N1_TX_BRP /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BRP*)0xF02186CCu)
/** Alias (User Manual Name) for CAN1_N1_TX_BRP.
* To use register names with standard convension, please use CAN1_N1_TX_BRP.
*/
#define CAN1_TXBRP1 (CAN1_N1_TX_BRP)

/** \brief 6D0, Tx Buffer Add Request ${i} */
#define CAN1_N1_TX_BAR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BAR*)0xF02186D0u)
/** Alias (User Manual Name) for CAN1_N1_TX_BAR.
* To use register names with standard convension, please use CAN1_N1_TX_BAR.
*/
#define CAN1_TXBAR1 (CAN1_N1_TX_BAR)

/** \brief 6D4, Tx Buffer Cancellation Request ${i} */
#define CAN1_N1_TX_BCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BCR*)0xF02186D4u)
/** Alias (User Manual Name) for CAN1_N1_TX_BCR.
* To use register names with standard convension, please use CAN1_N1_TX_BCR.
*/
#define CAN1_TXBCR1 (CAN1_N1_TX_BCR)

/** \brief 6D8, Tx Buffer Transmission Occurred ${i} */
#define CAN1_N1_TX_BTO /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BTO*)0xF02186D8u)
/** Alias (User Manual Name) for CAN1_N1_TX_BTO.
* To use register names with standard convension, please use CAN1_N1_TX_BTO.
*/
#define CAN1_TXBTO1 (CAN1_N1_TX_BTO)

/** \brief 6DC, Tx Buffer Cancellation Finished ${i} */
#define CAN1_N1_TX_BCF /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BCF*)0xF02186DCu)
/** Alias (User Manual Name) for CAN1_N1_TX_BCF.
* To use register names with standard convension, please use CAN1_N1_TX_BCF.
*/
#define CAN1_TXBCF1 (CAN1_N1_TX_BCF)

