Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_reg.h
/** \brief A2C, Timeout Counter Value ${i} */
#define CAN1_N2_TOCV /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TOCV*)0xF0218A2Cu)
/** Alias (User Manual Name) for CAN1_N2_TOCV.
* To use register names with standard convension, please use CAN1_N2_TOCV.
*/
#define CAN1_TOCV2 (CAN1_N2_TOCV)

/** \brief A40, Error Counter Register ${i} */
#define CAN1_N2_ECR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ECR*)0xF0218A40u)
/** Alias (User Manual Name) for CAN1_N2_ECR.
* To use register names with standard convension, please use CAN1_N2_ECR.
*/
#define CAN1_ECR2 (CAN1_N2_ECR)

/** \brief A44, Protocol Status Register ${i} */
#define CAN1_N2_PSR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_PSR*)0xF0218A44u)
/** Alias (User Manual Name) for CAN1_N2_PSR.
* To use register names with standard convension, please use CAN1_N2_PSR.
*/
#define CAN1_PSR2 (CAN1_N2_PSR)

/** \brief A48, Transmitter Delay Compensation Register ${i} */
#define CAN1_N2_TDCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TDCR*)0xF0218A48u)
/** Alias (User Manual Name) for CAN1_N2_TDCR.
* To use register names with standard convension, please use CAN1_N2_TDCR.
*/
#define CAN1_TDCR2 (CAN1_N2_TDCR)

/** \brief A50, Interrupt Register ${i} */
#define CAN1_N2_IR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IR*)0xF0218A50u)
/** Alias (User Manual Name) for CAN1_N2_IR.
* To use register names with standard convension, please use CAN1_N2_IR.
*/
#define CAN1_IR2 (CAN1_N2_IR)

/** \brief A54, Interrupt Enable ${i} */
#define CAN1_N2_IE /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IE*)0xF0218A54u)
/** Alias (User Manual Name) for CAN1_N2_IE.
* To use register names with standard convension, please use CAN1_N2_IE.
*/
#define CAN1_IE2 (CAN1_N2_IE)

/** \brief A80, Global Filter Configuration ${i} */
#define CAN1_N2_GFC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_GFC*)0xF0218A80u)
/** Alias (User Manual Name) for CAN1_N2_GFC.
* To use register names with standard convension, please use CAN1_N2_GFC.
*/
#define CAN1_GFC2 (CAN1_N2_GFC)

/** \brief A84, Standard ID Filter Configuration ${i} */
#define CAN1_N2_SIDFC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_SIDFC*)0xF0218A84u)
/** Alias (User Manual Name) for CAN1_N2_SIDFC.
* To use register names with standard convension, please use CAN1_N2_SIDFC.
*/
#define CAN1_SIDFC2 (CAN1_N2_SIDFC)

/** \brief A88, Extended ID Filter Configuration ${i} */
#define CAN1_N2_XIDFC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_XIDFC*)0xF0218A88u)
/** Alias (User Manual Name) for CAN1_N2_XIDFC.
* To use register names with standard convension, please use CAN1_N2_XIDFC.
*/
#define CAN1_XIDFC2 (CAN1_N2_XIDFC)

/** \brief A90, Extended ID AND Mask ${i} */
#define CAN1_N2_XIDAM /*lint --e(923)*/ (*(volatile Ifx_CAN_N_XIDAM*)0xF0218A90u)
/** Alias (User Manual Name) for CAN1_N2_XIDAM.
* To use register names with standard convension, please use CAN1_N2_XIDAM.
*/
#define CAN1_XIDAM2 (CAN1_N2_XIDAM)

/** \brief A94, High Priority Message Status ${i} */
#define CAN1_N2_HPMS /*lint --e(923)*/ (*(volatile Ifx_CAN_N_HPMS*)0xF0218A94u)
/** Alias (User Manual Name) for CAN1_N2_HPMS.
* To use register names with standard convension, please use CAN1_N2_HPMS.
*/
#define CAN1_HPMS2 (CAN1_N2_HPMS)

/** \brief A98, New Data 1 ${i} */
#define CAN1_N2_NDAT1 /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NDAT1*)0xF0218A98u)
/** Alias (User Manual Name) for CAN1_N2_NDAT1.
* To use register names with standard convension, please use CAN1_N2_NDAT1.
*/
#define CAN1_NDAT12 (CAN1_N2_NDAT1)

/** \brief A9C, New Data 2 ${i} */
#define CAN1_N2_NDAT2 /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NDAT2*)0xF0218A9Cu)
/** Alias (User Manual Name) for CAN1_N2_NDAT2.
* To use register names with standard convension, please use CAN1_N2_NDAT2.
*/
#define CAN1_NDAT22 (CAN1_N2_NDAT2)

/** \brief AA0, Rx FIFO 0 Configuration ${i} */
#define CAN1_N2_RX_F0C /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_F0C*)0xF0218AA0u)
/** Alias (User Manual Name) for CAN1_N2_RX_F0C.
* To use register names with standard convension, please use CAN1_N2_RX_F0C.
*/
#define CAN1_RXF0C2 (CAN1_N2_RX_F0C)

/** \brief AA4, Rx FIFO 0 Status ${i} */
#define CAN1_N2_RX_F0S /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_F0S*)0xF0218AA4u)
/** Alias (User Manual Name) for CAN1_N2_RX_F0S.
* To use register names with standard convension, please use CAN1_N2_RX_F0S.
*/
#define CAN1_RXF0S2 (CAN1_N2_RX_F0S)

/** \brief AA8, Rx FIFO 0 Acknowledge ${i} */
#define CAN1_N2_RX_F0A /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_F0A*)0xF0218AA8u)
/** Alias (User Manual Name) for CAN1_N2_RX_F0A.
* To use register names with standard convension, please use CAN1_N2_RX_F0A.
*/
#define CAN1_RXF0A2 (CAN1_N2_RX_F0A)

/** \brief AAC, Rx Buffer Configuration ${i} */
#define CAN1_N2_RX_BC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_BC*)0xF0218AACu)
/** Alias (User Manual Name) for CAN1_N2_RX_BC.
* To use register names with standard convension, please use CAN1_N2_RX_BC.
*/
#define CAN1_RXBC2 (CAN1_N2_RX_BC)

/** \brief AB0, Rx FIFO 1 Configuration ${i} */
#define CAN1_N2_RX_F1C /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_F1C*)0xF0218AB0u)
/** Alias (User Manual Name) for CAN1_N2_RX_F1C.
* To use register names with standard convension, please use CAN1_N2_RX_F1C.
*/
#define CAN1_RXF1C2 (CAN1_N2_RX_F1C)

/** \brief AB4, Rx FIFO 1 Status ${i} */
#define CAN1_N2_RX_F1S /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_F1S*)0xF0218AB4u)
/** Alias (User Manual Name) for CAN1_N2_RX_F1S.
* To use register names with standard convension, please use CAN1_N2_RX_F1S.
*/
#define CAN1_RXF1S2 (CAN1_N2_RX_F1S)

/** \brief AB8, Rx FIFO 1 Acknowledge ${i} */
#define CAN1_N2_RX_F1A /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_F1A*)0xF0218AB8u)
/** Alias (User Manual Name) for CAN1_N2_RX_F1A.
* To use register names with standard convension, please use CAN1_N2_RX_F1A.
*/
#define CAN1_RXF1A2 (CAN1_N2_RX_F1A)

/** \brief ABC, Rx Buffer/FIFO Element Size Configuration ${i} */
#define CAN1_N2_RX_ESC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_ESC*)0xF0218ABCu)
/** Alias (User Manual Name) for CAN1_N2_RX_ESC.
* To use register names with standard convension, please use CAN1_N2_RX_ESC.
*/
#define CAN1_RXESC2 (CAN1_N2_RX_ESC)

