Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_reg.h
/** \brief 20C, Data Bit Timing & Prescaler Register ${i} */
#define CAN2_N0_DBTP /*lint --e(923)*/ (*(volatile Ifx_CAN_N_DBTP*)0xF022820Cu)
/** Alias (User Manual Name) for CAN2_N0_DBTP.
* To use register names with standard convension, please use CAN2_N0_DBTP.
*/
#define CAN2_DBTP0 (CAN2_N0_DBTP)

/** \brief 210, Test Register ${i} */
#define CAN2_N0_TEST /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TEST*)0xF0228210u)
/** Alias (User Manual Name) for CAN2_N0_TEST.
* To use register names with standard convension, please use CAN2_N0_TEST.
*/
#define CAN2_TEST0 (CAN2_N0_TEST)

/** \brief 214, RAM Watchdog ${i} */
#define CAN2_N0_RWD /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RWD*)0xF0228214u)
/** Alias (User Manual Name) for CAN2_N0_RWD.
* To use register names with standard convension, please use CAN2_N0_RWD.
*/
#define CAN2_RWD0 (CAN2_N0_RWD)

/** \brief 218, CC Control Register ${i} */
#define CAN2_N0_CCCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_CCCR*)0xF0228218u)
/** Alias (User Manual Name) for CAN2_N0_CCCR.
* To use register names with standard convension, please use CAN2_N0_CCCR.
*/
#define CAN2_CCCR0 (CAN2_N0_CCCR)

/** \brief 21C, Nominal Bit Timing & Prescaler Register ${i} */
#define CAN2_N0_NBTP /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NBTP*)0xF022821Cu)
/** Alias (User Manual Name) for CAN2_N0_NBTP.
* To use register names with standard convension, please use CAN2_N0_NBTP.
*/
#define CAN2_NBTP0 (CAN2_N0_NBTP)

/** \brief 220, Timestamp Counter Configuration ${i} */
#define CAN2_N0_TSCC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TSCC*)0xF0228220u)
/** Alias (User Manual Name) for CAN2_N0_TSCC.
* To use register names with standard convension, please use CAN2_N0_TSCC.
*/
#define CAN2_TSCC0 (CAN2_N0_TSCC)

/** \brief 224, Timestamp Counter Value ${i} */
#define CAN2_N0_TSCV /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TSCV*)0xF0228224u)
/** Alias (User Manual Name) for CAN2_N0_TSCV.
* To use register names with standard convension, please use CAN2_N0_TSCV.
*/
#define CAN2_TSCV0 (CAN2_N0_TSCV)

/** \brief 228, Timeout Counter Configuration ${i} */
#define CAN2_N0_TOCC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TOCC*)0xF0228228u)
/** Alias (User Manual Name) for CAN2_N0_TOCC.
* To use register names with standard convension, please use CAN2_N0_TOCC.
*/
#define CAN2_TOCC0 (CAN2_N0_TOCC)

/** \brief 22C, Timeout Counter Value ${i} */
#define CAN2_N0_TOCV /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TOCV*)0xF022822Cu)
/** Alias (User Manual Name) for CAN2_N0_TOCV.
* To use register names with standard convension, please use CAN2_N0_TOCV.
*/
#define CAN2_TOCV0 (CAN2_N0_TOCV)

/** \brief 240, Error Counter Register ${i} */
#define CAN2_N0_ECR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ECR*)0xF0228240u)
/** Alias (User Manual Name) for CAN2_N0_ECR.
* To use register names with standard convension, please use CAN2_N0_ECR.
*/
#define CAN2_ECR0 (CAN2_N0_ECR)

/** \brief 244, Protocol Status Register ${i} */
#define CAN2_N0_PSR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_PSR*)0xF0228244u)
/** Alias (User Manual Name) for CAN2_N0_PSR.
* To use register names with standard convension, please use CAN2_N0_PSR.
*/
#define CAN2_PSR0 (CAN2_N0_PSR)

/** \brief 248, Transmitter Delay Compensation Register ${i} */
#define CAN2_N0_TDCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TDCR*)0xF0228248u)
/** Alias (User Manual Name) for CAN2_N0_TDCR.
* To use register names with standard convension, please use CAN2_N0_TDCR.
*/
#define CAN2_TDCR0 (CAN2_N0_TDCR)

/** \brief 250, Interrupt Register ${i} */
#define CAN2_N0_IR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IR*)0xF0228250u)
/** Alias (User Manual Name) for CAN2_N0_IR.
* To use register names with standard convension, please use CAN2_N0_IR.
*/
#define CAN2_IR0 (CAN2_N0_IR)

/** \brief 254, Interrupt Enable ${i} */
#define CAN2_N0_IE /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IE*)0xF0228254u)
/** Alias (User Manual Name) for CAN2_N0_IE.
* To use register names with standard convension, please use CAN2_N0_IE.
*/
#define CAN2_IE0 (CAN2_N0_IE)

/** \brief 280, Global Filter Configuration ${i} */
#define CAN2_N0_GFC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_GFC*)0xF0228280u)
/** Alias (User Manual Name) for CAN2_N0_GFC.
* To use register names with standard convension, please use CAN2_N0_GFC.
*/
#define CAN2_GFC0 (CAN2_N0_GFC)

/** \brief 284, Standard ID Filter Configuration ${i} */
#define CAN2_N0_SIDFC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_SIDFC*)0xF0228284u)
/** Alias (User Manual Name) for CAN2_N0_SIDFC.
* To use register names with standard convension, please use CAN2_N0_SIDFC.
*/
#define CAN2_SIDFC0 (CAN2_N0_SIDFC)

/** \brief 288, Extended ID Filter Configuration ${i} */
#define CAN2_N0_XIDFC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_XIDFC*)0xF0228288u)
/** Alias (User Manual Name) for CAN2_N0_XIDFC.
* To use register names with standard convension, please use CAN2_N0_XIDFC.
*/
#define CAN2_XIDFC0 (CAN2_N0_XIDFC)

/** \brief 290, Extended ID AND Mask ${i} */
#define CAN2_N0_XIDAM /*lint --e(923)*/ (*(volatile Ifx_CAN_N_XIDAM*)0xF0228290u)
/** Alias (User Manual Name) for CAN2_N0_XIDAM.
* To use register names with standard convension, please use CAN2_N0_XIDAM.
*/
#define CAN2_XIDAM0 (CAN2_N0_XIDAM)

/** \brief 294, High Priority Message Status ${i} */
#define CAN2_N0_HPMS /*lint --e(923)*/ (*(volatile Ifx_CAN_N_HPMS*)0xF0228294u)
/** Alias (User Manual Name) for CAN2_N0_HPMS.
* To use register names with standard convension, please use CAN2_N0_HPMS.
*/
#define CAN2_HPMS0 (CAN2_N0_HPMS)

/** \brief 298, New Data 1 ${i} */
#define CAN2_N0_NDAT1 /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NDAT1*)0xF0228298u)
/** Alias (User Manual Name) for CAN2_N0_NDAT1.
* To use register names with standard convension, please use CAN2_N0_NDAT1.
*/
#define CAN2_NDAT10 (CAN2_N0_NDAT1)

/** \brief 29C, New Data 2 ${i} */
#define CAN2_N0_NDAT2 /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NDAT2*)0xF022829Cu)
/** Alias (User Manual Name) for CAN2_N0_NDAT2.
* To use register names with standard convension, please use CAN2_N0_NDAT2.
*/
#define CAN2_NDAT20 (CAN2_N0_NDAT2)

/** \brief 2A0, Rx FIFO 0 Configuration ${i} */
#define CAN2_N0_RX_F0C /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_F0C*)0xF02282A0u)
/** Alias (User Manual Name) for CAN2_N0_RX_F0C.
* To use register names with standard convension, please use CAN2_N0_RX_F0C.
*/
#define CAN2_RXF0C0 (CAN2_N0_RX_F0C)

/** \brief 2A4, Rx FIFO 0 Status ${i} */
#define CAN2_N0_RX_F0S /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_F0S*)0xF02282A4u)
/** Alias (User Manual Name) for CAN2_N0_RX_F0S.
* To use register names with standard convension, please use CAN2_N0_RX_F0S.
*/
#define CAN2_RXF0S0 (CAN2_N0_RX_F0S)

