Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_reg.h
/** \brief 2A8, Rx FIFO 0 Acknowledge ${i} */
#define CAN2_N0_RX_F0A /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_F0A*)0xF02282A8u)
/** Alias (User Manual Name) for CAN2_N0_RX_F0A.
* To use register names with standard convension, please use CAN2_N0_RX_F0A.
*/
#define CAN2_RXF0A0 (CAN2_N0_RX_F0A)

/** \brief 2AC, Rx Buffer Configuration ${i} */
#define CAN2_N0_RX_BC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_BC*)0xF02282ACu)
/** Alias (User Manual Name) for CAN2_N0_RX_BC.
* To use register names with standard convension, please use CAN2_N0_RX_BC.
*/
#define CAN2_RXBC0 (CAN2_N0_RX_BC)

/** \brief 2B0, Rx FIFO 1 Configuration ${i} */
#define CAN2_N0_RX_F1C /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_F1C*)0xF02282B0u)
/** Alias (User Manual Name) for CAN2_N0_RX_F1C.
* To use register names with standard convension, please use CAN2_N0_RX_F1C.
*/
#define CAN2_RXF1C0 (CAN2_N0_RX_F1C)

/** \brief 2B4, Rx FIFO 1 Status ${i} */
#define CAN2_N0_RX_F1S /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_F1S*)0xF02282B4u)
/** Alias (User Manual Name) for CAN2_N0_RX_F1S.
* To use register names with standard convension, please use CAN2_N0_RX_F1S.
*/
#define CAN2_RXF1S0 (CAN2_N0_RX_F1S)

/** \brief 2B8, Rx FIFO 1 Acknowledge ${i} */
#define CAN2_N0_RX_F1A /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_F1A*)0xF02282B8u)
/** Alias (User Manual Name) for CAN2_N0_RX_F1A.
* To use register names with standard convension, please use CAN2_N0_RX_F1A.
*/
#define CAN2_RXF1A0 (CAN2_N0_RX_F1A)

/** \brief 2BC, Rx Buffer/FIFO Element Size Configuration ${i} */
#define CAN2_N0_RX_ESC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RX_ESC*)0xF02282BCu)
/** Alias (User Manual Name) for CAN2_N0_RX_ESC.
* To use register names with standard convension, please use CAN2_N0_RX_ESC.
*/
#define CAN2_RXESC0 (CAN2_N0_RX_ESC)

/** \brief 2C0, Tx Buffer Configuration ${i} */
#define CAN2_N0_TX_BC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BC*)0xF02282C0u)
/** Alias (User Manual Name) for CAN2_N0_TX_BC.
* To use register names with standard convension, please use CAN2_N0_TX_BC.
*/
#define CAN2_TXBC0 (CAN2_N0_TX_BC)

/** \brief 2C4, Tx FIFO/Queue Status ${i} */
#define CAN2_N0_TX_FQS /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_FQS*)0xF02282C4u)
/** Alias (User Manual Name) for CAN2_N0_TX_FQS.
* To use register names with standard convension, please use CAN2_N0_TX_FQS.
*/
#define CAN2_TXFQS0 (CAN2_N0_TX_FQS)

/** \brief 2C8, Tx Buffer Element Size Configuration ${i} */
#define CAN2_N0_TX_ESC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_ESC*)0xF02282C8u)
/** Alias (User Manual Name) for CAN2_N0_TX_ESC.
* To use register names with standard convension, please use CAN2_N0_TX_ESC.
*/
#define CAN2_TXESC0 (CAN2_N0_TX_ESC)

/** \brief 2CC, Tx Buffer Request Pending ${i} */
#define CAN2_N0_TX_BRP /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BRP*)0xF02282CCu)
/** Alias (User Manual Name) for CAN2_N0_TX_BRP.
* To use register names with standard convension, please use CAN2_N0_TX_BRP.
*/
#define CAN2_TXBRP0 (CAN2_N0_TX_BRP)

/** \brief 2D0, Tx Buffer Add Request ${i} */
#define CAN2_N0_TX_BAR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BAR*)0xF02282D0u)
/** Alias (User Manual Name) for CAN2_N0_TX_BAR.
* To use register names with standard convension, please use CAN2_N0_TX_BAR.
*/
#define CAN2_TXBAR0 (CAN2_N0_TX_BAR)

/** \brief 2D4, Tx Buffer Cancellation Request ${i} */
#define CAN2_N0_TX_BCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BCR*)0xF02282D4u)
/** Alias (User Manual Name) for CAN2_N0_TX_BCR.
* To use register names with standard convension, please use CAN2_N0_TX_BCR.
*/
#define CAN2_TXBCR0 (CAN2_N0_TX_BCR)

/** \brief 2D8, Tx Buffer Transmission Occurred ${i} */
#define CAN2_N0_TX_BTO /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BTO*)0xF02282D8u)
/** Alias (User Manual Name) for CAN2_N0_TX_BTO.
* To use register names with standard convension, please use CAN2_N0_TX_BTO.
*/
#define CAN2_TXBTO0 (CAN2_N0_TX_BTO)

/** \brief 2DC, Tx Buffer Cancellation Finished ${i} */
#define CAN2_N0_TX_BCF /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BCF*)0xF02282DCu)
/** Alias (User Manual Name) for CAN2_N0_TX_BCF.
* To use register names with standard convension, please use CAN2_N0_TX_BCF.
*/
#define CAN2_TXBCF0 (CAN2_N0_TX_BCF)

/** \brief 2E0, Tx Buffer Transmission Interrupt Enable ${i} */
#define CAN2_N0_TX_BTIE /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BTIE*)0xF02282E0u)
/** Alias (User Manual Name) for CAN2_N0_TX_BTIE.
* To use register names with standard convension, please use CAN2_N0_TX_BTIE.
*/
#define CAN2_TXBTIE0 (CAN2_N0_TX_BTIE)

/** \brief 2E4, Tx Buffer Cancellation Finished Interrupt Enable ${i} */
#define CAN2_N0_TX_BCIE /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_BCIE*)0xF02282E4u)
/** Alias (User Manual Name) for CAN2_N0_TX_BCIE.
* To use register names with standard convension, please use CAN2_N0_TX_BCIE.
*/
#define CAN2_TXBCIE0 (CAN2_N0_TX_BCIE)

/** \brief 2F0, Tx Event FIFO Configuration ${i} */
#define CAN2_N0_TX_EFC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_EFC*)0xF02282F0u)
/** Alias (User Manual Name) for CAN2_N0_TX_EFC.
* To use register names with standard convension, please use CAN2_N0_TX_EFC.
*/
#define CAN2_TXEFC0 (CAN2_N0_TX_EFC)

/** \brief 2F4, Tx Event FIFO Status ${i} */
#define CAN2_N0_TX_EFS /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_EFS*)0xF02282F4u)
/** Alias (User Manual Name) for CAN2_N0_TX_EFS.
* To use register names with standard convension, please use CAN2_N0_TX_EFS.
*/
#define CAN2_TXEFS0 (CAN2_N0_TX_EFS)

/** \brief 2F8, Tx Event FIFO Acknowledge ${i} */
#define CAN2_N0_TX_EFA /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TX_EFA*)0xF02282F8u)
/** Alias (User Manual Name) for CAN2_N0_TX_EFA.
* To use register names with standard convension, please use CAN2_N0_TX_EFA.
*/
#define CAN2_TXEFA0 (CAN2_N0_TX_EFA)

/** \brief 500, Access Enable Register CAN Node ${i} 0 */
#define CAN2_N1_ACCENNODE0_ /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ACCENNODE0_*)0xF0228500u)
/** Alias (User Manual Name) for CAN2_N1_ACCENNODE0_.
* To use register names with standard convension, please use CAN2_N1_ACCENNODE0_.
*/
#define CAN2_ACCENNODE10 (CAN2_N1_ACCENNODE0_)

/** \brief 504, Access Enable Register CAN Node ${i} 1 */
#define CAN2_N1_ACCENNODE1_ /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ACCENNODE1_*)0xF0228504u)
/** Alias (User Manual Name) for CAN2_N1_ACCENNODE1_.
* To use register names with standard convension, please use CAN2_N1_ACCENNODE1_.
*/
#define CAN2_ACCENNODE11 (CAN2_N1_ACCENNODE1_)

/** \brief 508, Start Address Node ${i} */
#define CAN2_N1_STARTADR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_STARTADR*)0xF0228508u)
/** Alias (User Manual Name) for CAN2_N1_STARTADR.
* To use register names with standard convension, please use CAN2_N1_STARTADR.
*/
#define CAN2_STARTADR1 (CAN2_N1_STARTADR)

/** \brief 50C, End Address Node ${i} */
#define CAN2_N1_ENDADR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ENDADR*)0xF022850Cu)
/** Alias (User Manual Name) for CAN2_N1_ENDADR.
* To use register names with standard convension, please use CAN2_N1_ENDADR.
*/
#define CAN2_ENDADR1 (CAN2_N1_ENDADR)

/** \brief 510, Interrupt Signalling Register ${i} */
#define CAN2_N1_ISREG /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ISREG*)0xF0228510u)
/** Alias (User Manual Name) for CAN2_N1_ISREG.
* To use register names with standard convension, please use CAN2_N1_ISREG.
*/
#define CAN2_ISREG1 (CAN2_N1_ISREG)

/** \brief 520, Node ${i} Timer Clock Control Register */
#define CAN2_N1_NT_CCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_CCR*)0xF0228520u)
/** Alias (User Manual Name) for CAN2_N1_NT_CCR.
* To use register names with standard convension, please use CAN2_N1_NT_CCR.
*/
#define CAN2_NTCCR1 (CAN2_N1_NT_CCR)

