Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_reg.h
/** \brief 524, Node ${i} Timer A Transmit Trigger Register */
#define CAN2_N1_NT_ATTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_ATTR*)0xF0228524u)
/** Alias (User Manual Name) for CAN2_N1_NT_ATTR.
* To use register names with standard convension, please use CAN2_N1_NT_ATTR.
*/
#define CAN2_NTATTR1 (CAN2_N1_NT_ATTR)

/** \brief 528, Node ${i} Timer B Transmit Trigger Register */
#define CAN2_N1_NT_BTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_BTTR*)0xF0228528u)
/** Alias (User Manual Name) for CAN2_N1_NT_BTTR.
* To use register names with standard convension, please use CAN2_N1_NT_BTTR.
*/
#define CAN2_NTBTTR1 (CAN2_N1_NT_BTTR)

/** \brief 52C, Node ${i} Timer C Transmit Trigger Register */
#define CAN2_N1_NT_CTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_CTTR*)0xF022852Cu)
/** Alias (User Manual Name) for CAN2_N1_NT_CTTR.
* To use register names with standard convension, please use CAN2_N1_NT_CTTR.
*/
#define CAN2_NTCTTR1 (CAN2_N1_NT_CTTR)

/** \brief 530, Node ${i} Timer Receive Timeout Register */
#define CAN2_N1_NT_RTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NT_RTR*)0xF0228530u)
/** Alias (User Manual Name) for CAN2_N1_NT_RTR.
* To use register names with standard convension, please use CAN2_N1_NT_RTR.
*/
#define CAN2_NTRTR1 (CAN2_N1_NT_RTR)

/** \brief 540, Node ${i} Port Control Register */
#define CAN2_N1_NPCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NPCR*)0xF0228540u)
/** Alias (User Manual Name) for CAN2_N1_NPCR.
* To use register names with standard convension, please use CAN2_N1_NPCR.
*/
#define CAN2_NPCR1 (CAN2_N1_NPCR)

/** \brief 600, Core Release Register ${i} */
#define CAN2_N1_CREL /*lint --e(923)*/ (*(volatile Ifx_CAN_N_CREL*)0xF0228600u)
/** Alias (User Manual Name) for CAN2_N1_CREL.
* To use register names with standard convension, please use CAN2_N1_CREL.
*/
#define CAN2_CREL1 (CAN2_N1_CREL)

/** \brief 604, Endian Register ${i} */
#define CAN2_N1_ENDN /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ENDN*)0xF0228604u)
/** Alias (User Manual Name) for CAN2_N1_ENDN.
* To use register names with standard convension, please use CAN2_N1_ENDN.
*/
#define CAN2_ENDN1 (CAN2_N1_ENDN)

/** \brief 60C, Data Bit Timing & Prescaler Register ${i} */
#define CAN2_N1_DBTP /*lint --e(923)*/ (*(volatile Ifx_CAN_N_DBTP*)0xF022860Cu)
/** Alias (User Manual Name) for CAN2_N1_DBTP.
* To use register names with standard convension, please use CAN2_N1_DBTP.
*/
#define CAN2_DBTP1 (CAN2_N1_DBTP)

/** \brief 610, Test Register ${i} */
#define CAN2_N1_TEST /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TEST*)0xF0228610u)
/** Alias (User Manual Name) for CAN2_N1_TEST.
* To use register names with standard convension, please use CAN2_N1_TEST.
*/
#define CAN2_TEST1 (CAN2_N1_TEST)

/** \brief 614, RAM Watchdog ${i} */
#define CAN2_N1_RWD /*lint --e(923)*/ (*(volatile Ifx_CAN_N_RWD*)0xF0228614u)
/** Alias (User Manual Name) for CAN2_N1_RWD.
* To use register names with standard convension, please use CAN2_N1_RWD.
*/
#define CAN2_RWD1 (CAN2_N1_RWD)

/** \brief 618, CC Control Register ${i} */
#define CAN2_N1_CCCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_CCCR*)0xF0228618u)
/** Alias (User Manual Name) for CAN2_N1_CCCR.
* To use register names with standard convension, please use CAN2_N1_CCCR.
*/
#define CAN2_CCCR1 (CAN2_N1_CCCR)

/** \brief 61C, Nominal Bit Timing & Prescaler Register ${i} */
#define CAN2_N1_NBTP /*lint --e(923)*/ (*(volatile Ifx_CAN_N_NBTP*)0xF022861Cu)
/** Alias (User Manual Name) for CAN2_N1_NBTP.
* To use register names with standard convension, please use CAN2_N1_NBTP.
*/
#define CAN2_NBTP1 (CAN2_N1_NBTP)

/** \brief 620, Timestamp Counter Configuration ${i} */
#define CAN2_N1_TSCC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TSCC*)0xF0228620u)
/** Alias (User Manual Name) for CAN2_N1_TSCC.
* To use register names with standard convension, please use CAN2_N1_TSCC.
*/
#define CAN2_TSCC1 (CAN2_N1_TSCC)

/** \brief 624, Timestamp Counter Value ${i} */
#define CAN2_N1_TSCV /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TSCV*)0xF0228624u)
/** Alias (User Manual Name) for CAN2_N1_TSCV.
* To use register names with standard convension, please use CAN2_N1_TSCV.
*/
#define CAN2_TSCV1 (CAN2_N1_TSCV)

/** \brief 628, Timeout Counter Configuration ${i} */
#define CAN2_N1_TOCC /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TOCC*)0xF0228628u)
/** Alias (User Manual Name) for CAN2_N1_TOCC.
* To use register names with standard convension, please use CAN2_N1_TOCC.
*/
#define CAN2_TOCC1 (CAN2_N1_TOCC)

/** \brief 62C, Timeout Counter Value ${i} */
#define CAN2_N1_TOCV /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TOCV*)0xF022862Cu)
/** Alias (User Manual Name) for CAN2_N1_TOCV.
* To use register names with standard convension, please use CAN2_N1_TOCV.
*/
#define CAN2_TOCV1 (CAN2_N1_TOCV)

/** \brief 640, Error Counter Register ${i} */
#define CAN2_N1_ECR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ECR*)0xF0228640u)
/** Alias (User Manual Name) for CAN2_N1_ECR.
* To use register names with standard convension, please use CAN2_N1_ECR.
*/
#define CAN2_ECR1 (CAN2_N1_ECR)

/** \brief 644, Protocol Status Register ${i} */
#define CAN2_N1_PSR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_PSR*)0xF0228644u)
/** Alias (User Manual Name) for CAN2_N1_PSR.
* To use register names with standard convension, please use CAN2_N1_PSR.
*/
#define CAN2_PSR1 (CAN2_N1_PSR)

/** \brief 648, Transmitter Delay Compensation Register ${i} */
#define CAN2_N1_TDCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TDCR*)0xF0228648u)
/** Alias (User Manual Name) for CAN2_N1_TDCR.
* To use register names with standard convension, please use CAN2_N1_TDCR.
*/
#define CAN2_TDCR1 (CAN2_N1_TDCR)

/** \brief 650, Interrupt Register ${i} */
#define CAN2_N1_IR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IR*)0xF0228650u)
/** Alias (User Manual Name) for CAN2_N1_IR.
* To use register names with standard convension, please use CAN2_N1_IR.
*/
#define CAN2_IR1 (CAN2_N1_IR)

/** \brief 654, Interrupt Enable ${i} */
#define CAN2_N1_IE /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IE*)0xF0228654u)
/** Alias (User Manual Name) for CAN2_N1_IE.
* To use register names with standard convension, please use CAN2_N1_IE.
*/
#define CAN2_IE1 (CAN2_N1_IE)

